{
  "backend/main.mo": "Main Motoko actor for the KPI/program tracking backend, defining data types (Program, KPI, TeamMember, etc.) and CRUD operations for programs, KPIs, team members, agendas, and user profiles with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping two ProfileSetupModal-related features (inline error handling and required name field with Principal ID fallback) to their implementing files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON dictionary providing one-sentence summaries of each frontend source file, serving as a reference document for the frontend codebase structure and component responsibilities.",
  "frontend/.deploy-trigger": "A static marker file used to force CI/CD rebuild and redeploy without making functional code changes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart colors, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'Program Timeline and Team KPI Tracking Application' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component managing the authentication and profile-setup flow: shows loading screens during identity/profile initialization, renders LoginPage when unauthenticated, ProfileSetupModal when no profile exists, and Dashboard otherwise.",
  "frontend/src/components/DashboardOverview.tsx": "Dashboard overview component that computes and displays aggregate metrics, division performance (for 5 divisions), and program/KPI status charts using Recharts with data fetched from backend query hooks.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable AlertDialog component for confirming delete actions, accepting title, description, and onConfirm/onClose callbacks with Cancel and Delete buttons.",
  "frontend/src/components/Footer.tsx": "Application footer displaying copyright year, a caffeine.ai attribution link with UTM tracking, and a gradient background with an accent-colored heart icon.",
  "frontend/src/components/Header.tsx": "Sticky app header displaying the SHQ logo/title, a theme toggle button, and a user dropdown menu with profile info and logout functionality.",
  "frontend/src/components/KpiFormDialog.tsx": "Modal dialog form for creating or editing a KPI, handling field validation, date conversion, and submission via create/update mutation hooks.",
  "frontend/src/components/KPIsTab.tsx": "KPI management tab that lists all KPIs in a filterable/searchable table, with role-based edit and delete controls for admins and coordinators.",
  "frontend/src/components/ProfileSetupModal.tsx": "First-time profile setup modal that prompts a logged-in user to enter their display name, saves it to the backend, and handles error messaging in Indonesian.",
  "frontend/src/components/program-calendar/CalendarCategoryLegend.tsx": "Renders a small color-coded legend showing the three calendar event categories: Programs, Team Agenda, and KPI Deadlines.",
  "frontend/src/components/program-calendar/calendarCategoryUtils.ts": "Utility functions for the calendar: provides category color mappings and computes per-day counts of programs, agenda items, and KPI deadlines for an array of dates.",
  "frontend/src/components/program-calendar/CalendarTabErrorBoundary.tsx": "React class-based error boundary for the calendar tab that catches render errors and displays a fallback UI with a retry button.",
  "frontend/src/components/program-calendar/DayCell.tsx": "Renders a single calendar day cell showing the date number and colored indicator bars for programs, agenda items, and KPI deadlines present on that day.",
  "frontend/src/components/program-calendar/DayDetailPanel.tsx": "A slide-in Sheet panel that lists all programs active on a selected date, showing status, priority, and key details for each, with click-through to program detail.",
  "frontend/src/components/program-calendar/GridDensityControl.tsx": "A toggle control with two buttons allowing the user to switch the calendar grid between 'comfortable' and 'compact' density modes.",
  "frontend/src/components/program-calendar/ProgramCalendarViewSwitcher.tsx": "A button group that lets users switch the calendar between month, week, day, and agenda view modes.",
  "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx": "A right-side Sheet drawer that displays full details of a selected program including status, priority, timeline, progress, and an optional edit button.",
  "frontend/src/components/program-calendar/programFilterUtils.ts": "Provides utility functions to filter a list of programs by division, PIC, status, and priority, and to count programs active on a specific day.",
  "frontend/src/components/program-calendar/statusPriorityStyles.ts": "Exports helper functions that return display label and CSS class/variant configurations for program status and priority values.",
  "frontend/src/components/program-calendar/views/AgendaListView.tsx": "Renders a 14-day agenda list grouped by day, showing programs, team agenda items, and KPI deadlines with badges and click handlers.",
  "frontend/src/components/program-calendar/views/DayListView.tsx": "Displays all programs, agenda items, and KPI deadlines for a single selected day in a list format with status and priority badges.",
  "frontend/src/components/program-calendar/views/MonthGridView.tsx": "Renders a full-month calendar grid with weekday headers, computing per-day category counts and delegating each cell to the DayCell component.",
  "frontend/src/components/program-calendar/views/WeekGridView.tsx": "Renders a 7-day week grid view, computing per-day category counts and displaying each day using the DayCell component.",
  "frontend/src/components/ProgramCalendarTab.tsx": "Full-featured program calendar tab supporting month, week, day, and agenda views with filtering by division/PIC/status/priority, reminder toggles, and program detail/edit drawers.",
  "frontend/src/components/ProgramCalendarTabBoundary.tsx": "React error boundary wrapper for ProgramCalendarTab that catches render errors, displays a fallback UI, and invalidates relevant React Query caches on reset.",
  "frontend/src/components/ProgramFormDialog.tsx": "A dialog form component for creating and editing programs, handling fields like name, description, division, person-in-charge, dates, status, priority, and progress with validation and mutation calls.",
  "frontend/src/components/programs/ProgramListItemCard.tsx": "A card component that displays a program's name, description, status, priority, dates, and unit, with optional edit and delete action buttons.",
  "frontend/src/components/ProgramsTab.tsx": "A tab view that lists all programs with search, filter (status/priority/division), and sort capabilities, plus controls for viewing, editing, and deleting programs via dialogs and a detail drawer.",
  "frontend/src/components/RelatedProgramCombobox.tsx": "A searchable combobox component for selecting a related program from a list, using a Popover with Command input and checkmark indicators.",
  "frontend/src/components/ReportsTab.tsx": "A reports tab that displays filtered programs and KPIs with options to export data as CSV, supporting filters by team, division, and priority.",
  "frontend/src/components/team/ManagerSelect.tsx": "A select dropdown for choosing a team member's manager, filtering out the current member and supporting an explicit 'no manager' option.",
  "frontend/src/components/team/PhotoUrlPreview.tsx": "Shows a live avatar preview for a given HTTPS photo URL, indicating load success or failure with appropriate icons.",
  "frontend/src/components/team/TeamFunctionalMemberNode.tsx": "Renders a selectable button node for a team member displaying their avatar, name, and role, used in a functional org-chart view.",
  "frontend/src/components/team/TeamMemberCard.tsx": "Renders a card UI for a team member with avatar display, photo upload functionality (with progress tracking), and optional edit/delete action buttons. Handles authentication checks before allowing avatar changes.",
  "frontend/src/components/team/TeamMemberDetailsPanel.tsx": "Displays a slide-out Sheet panel with detailed information about a selected team member, including their avatar, role, division, manager, and direct reports.",
  "frontend/src/components/team/TeamStructureNode.tsx": "Renders a single node in a hierarchical org chart tree, showing a team member's avatar, name, role, and division badge, and recursively renders child nodes with connector lines.",
  "frontend/src/components/team/TeamStructureView.tsx": "Displays a functional organizational chart grouped by division, with a root/director node at the top, hierarchy warnings, and a details panel that opens on member selection.",
  "frontend/src/components/TeamMemberFormDialog.tsx": "A dialog form for creating and editing team members, including fields for name, division, role, manager, and avatar photo upload with validation and progress tracking.",
  "frontend/src/components/TeamMembersTab.tsx": "A tab view for managing team members with search, card/structure view toggle, and add/edit/delete actions gated by user role and authentication state.",
  "frontend/src/components/TopPillNav.tsx": "Renders a pill-style tab navigation bar with links to Dashboard, Calendar, Program, KPI, Team, Laporan, and optionally Pengguna (admin only).",
  "frontend/src/components/UserProfilesTab.tsx": "Admin-only tab that displays a table of all user profiles with controls to update roles and approve/reject users using React Query mutations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and returns an authenticated or anonymous backend actor using Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useCalendarReminders.ts": "Custom hook that periodically checks programs, agenda items, and KPI deadlines to show toast reminders at 24-hour and 3-hour intervals before each event, using deduplication to avoid repeat notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useMediaQuery.ts": "A React hook that tracks whether a CSS media query matches, updating state reactively on changes.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, admin checks, programs, KPIs, team members, and agenda items via the actor.",
  "frontend/src/index.css": "Global CSS file defining Tailwind base/components/utilities and a purple-blue-green OKLCH color theme with light/dark mode CSS variables and custom gradient utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page component that renders a tabbed layout with sections for overview, calendar, programs, KPIs, team, reports, and admin user management.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that provides Internet Identity authentication with a styled card UI showing login status and feature highlights.",
  "frontend/src/utils/imageNormalize.ts": "Client-side utility that normalizes image files for upload by resizing, compressing, and converting them to JPEG/PNG via canvas, with HEIC rejection and size validation.",
  "frontend/src/utils/imageUpload.ts": "Deprecated utility for uploading images to ImgBB with client-side normalization and XHR progress tracking. Kept for backward compatibility; team member photos should use backend blob storage instead.",
  "frontend/src/utils/reminderDedup.ts": "Manages deduplication of calendar reminders using localStorage, tracking shown reminders with a 48-hour expiry and auto-cleaning expired records.",
  "frontend/src/utils/safeBrowserStorage.ts": "Provides safe wrappers around localStorage for reading and writing JSON and string values, with error handling and SSR fallbacks.",
  "frontend/src/utils/teamFunctionalStructure.ts": "Utility functions for processing team member data: collecting all members from a hierarchy tree, grouping members by division, and sorting members by name.",
  "frontend/src/utils/teamHierarchy.ts": "Builds a parent-child hierarchy tree from a flat list of team members and detects issues like circular references, self-references, and missing managers.",
  "frontend/src/utils/teamMemberAvatar.ts": "Derives a displayable image URL for a team member avatar, supporting backend ExternalBlob objects and legacy URL strings.",
  "frontend/src/utils/teamMemberAvatarUpload.ts": "Uploads a team member avatar to backend blob storage by normalizing the image, converting it to a Uint8Array, and wrapping it in an ExternalBlob with optional progress tracking.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and helpers to clear sensitive params from the URL bar.",
  "frontend/src/utils/urlValidation.ts": "Provides simple validators to check whether a string is a valid HTTP/HTTPS or HTTPS-only URL.",
  "frontend/src/utils/userDisplayName.ts": "Derives a user's display name and initials from their profile, falling back to a shortened principal ID or default string when no name is available.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, extended border radii, box shadows, gradient backgrounds, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current project state, known bugs, existing features, and new feature requests for a web app using Internet Identity authentication. Focuses on fixing critical login/registration bugs related to admin role assignment, profile save errors, and data persistence across redeployments."
}