{
  "backend/main.mo": "Defines authorization mixin, core data types for programs, KPIs, teams, and comparison utilities for sorting.",
  "feature_evidence.json": "Lists feature evidence entries linking feature fixes to affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of multiple frontend files describing UI behavior, features, and workflows.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Handles authentication flow, profile setup gating, and rendering of the main dashboard.",
  "frontend/src/components/DashboardOverview.tsx": "Computes program/KPI metrics and renders charts and metric cards with loading skeletons.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable delete confirmation dialog built on alert-dialog components.",
  "frontend/src/components/Footer.tsx": "Simple footer component with attribution and external link.",
  "frontend/src/components/Header.tsx": "Provides the app header with logo, theme toggle, user profile display, and logout logic using identity hooks.",
  "frontend/src/components/KpiFormDialog.tsx": "Form dialog for creating or editing a KPI, handling fields, validation, and submission to backend mutations.",
  "frontend/src/components/KPIsTab.tsx": "Displays and filters KPI records with search, status, period, and team filters, and supports editing and deleting KPIs.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter their name and role, then saving the profile via a mutation.",
  "frontend/src/components/program-calendar/CalendarCategoryLegend.tsx": "Renders a legend showing color labels for program, agenda, and KPI calendar categories.",
  "frontend/src/components/program-calendar/calendarCategoryUtils.ts": "Utilities for category colors and counting programs, agendas, and KPIs per day.",
  "frontend/src/components/program-calendar/CalendarTabErrorBoundary.tsx": "Error boundary component that displays a fallback UI and reset button when calendar rendering fails.",
  "frontend/src/components/program-calendar/DayCell.tsx": "Clickable calendar grid cell showing date styling, current-month state, and colored category bars based on counts.",
  "frontend/src/components/program-calendar/DayDetailPanel.tsx": "Side sheet showing detailed list of programs occurring on a selected date, with sorting and program click handling.",
  "frontend/src/components/program-calendar/GridDensityControl.tsx": "Toggle control for switching between comfortable and compact calendar grid density.",
  "frontend/src/components/program-calendar/ProgramCalendarViewSwitcher.tsx": "Button group for selecting calendar view mode (month, week, day, agenda).",
  "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx": "Right-side drawer showing full program details with status, priority, timeline, and optional edit button.",
  "frontend/src/components/program-calendar/programFilterUtils.ts": "Functions to filter program lists by multiple fields and count programs active on a specific date.",
  "frontend/src/components/program-calendar/statusPriorityStyles.ts": "Provides label and style mappings for program status and priority values.",
  "frontend/src/components/program-calendar/views/AgendaListView.tsx": "Builds a 14‑day agenda list grouping programs, agenda items, and KPI deadlines by day and rendering them with badges and click actions.",
  "frontend/src/components/program-calendar/views/DayListView.tsx": "Filters and displays all programs, agenda items, and KPI deadlines for a single day with interactive program cards.",
  "frontend/src/components/program-calendar/views/MonthGridView.tsx": "Generates a full monthly calendar grid and passes per‑day item counts to DayCell components for visualization.",
  "frontend/src/components/program-calendar/views/WeekGridView.tsx": "Renders a week‑long grid view and displays category counts for each day using DayCell components.",
  "frontend/src/components/ProgramCalendarTab.tsx": "Main program calendar UI managing views, filters, reminders, date ranges, and program/KPI/agenda data loading.",
  "frontend/src/components/ProgramCalendarTabBoundary.tsx": "Error boundary for the program calendar that displays a fallback UI and resets related queries when retried.",
  "frontend/src/components/ProgramFormDialog.tsx": "Dialog form for creating or editing a program, managing form state, validation, and submit actions using React Query mutations.",
  "frontend/src/components/programs/ProgramListItemCard.tsx": "Displays a program in a card with badges, metadata, and edit/delete actions, opening detail view on card click.",
  "frontend/src/components/ProgramsTab.tsx": "Programs page with search, filtering, sorting, CRUD actions, and detail drawer integration.",
  "frontend/src/components/RelatedProgramCombobox.tsx": "Combobox component for selecting a related program with searchable popover UI.",
  "frontend/src/components/ReportsTab.tsx": "Reports page that filters programs and KPIs and exports report data to CSV.",
  "frontend/src/components/team/ManagerSelect.tsx": "Provides a dropdown to select a manager from team members, excluding the current member.",
  "frontend/src/components/team/PhotoUrlPreview.tsx": "Shows a live preview of an avatar image from a URL with load/error status indicators.",
  "frontend/src/components/team/TeamFunctionalMemberNode.tsx": "Renders a selectable team member tile with avatar, initials fallback, and role information.",
  "frontend/src/components/team/TeamMemberCard.tsx": "Card component showing a team member with avatar upload support, edit/delete actions, and immediate cache updates after photo changes.",
  "frontend/src/components/team/TeamMemberDetailsPanel.tsx": "Side panel displaying detailed team member info including manager, division, and direct reports.",
  "frontend/src/components/team/TeamStructureNode.tsx": "Recursive node component rendering a team member within a hierarchical org chart, including avatar validation and child connectors.",
  "frontend/src/components/team/TeamStructureView.tsx": "Builds and displays the organizational structure with hierarchy warnings and selectable member details.",
  "frontend/src/components/TeamMemberFormDialog.tsx": "Dialog for creating or editing team members, including image upload and manager selection.",
  "frontend/src/components/TeamMembersTab.tsx": "Team management page supporting filtering, editing, deleting, and viewing members in cards or structure view.",
  "frontend/src/components/UserProfilesTab.tsx": "Admin-only user management UI that lists profiles and allows role changes with loading and permission states.",
  "frontend/src/hooks/useActor.ts": "React hook creating and maintaining an authenticated or anonymous backend actor, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCalendarReminders.ts": "Hook that periodically checks upcoming program, agenda, and KPI deadlines and shows deduplicated time‑based reminders.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication including login, status tracking, and identity persistence.",
  "frontend/src/hooks/useMediaQuery.ts": "Custom hook that returns whether a given CSS media query currently matches using matchMedia with event listeners.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, admin data, programs, KPIs, and related backend resources through an actor.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables, dark mode colors, utility classes, and animations for the application UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tab navigation, showing various management views and admin-only sections based on user role.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login screen with Internet Identity authentication and loading state handling.",
  "frontend/src/utils/imageUpload.ts": "Implements image upload via ImgBB with an Imgur fallback, including validation, progress tracking, and error handling.",
  "frontend/src/utils/reminderDedup.ts": "Manages reminder deduplication via localStorage, generating keys and tracking timestamps with automatic expiry cleanup.",
  "frontend/src/utils/safeBrowserStorage.ts": "Provides safe wrappers around localStorage for JSON and string access with error handling and fallbacks.",
  "frontend/src/utils/teamFunctionalStructure.ts": "Collects hierarchy members, groups them by normalized division, and offers non-mutating name sorting.",
  "frontend/src/utils/teamHierarchy.ts": "Builds a team hierarchy tree with cycle and missing-manager detection, producing roots, orphans, and warnings.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL params (including hash), persisting them in sessionStorage, and clearing stored values.",
  "frontend/src/utils/urlValidation.ts": "Validates whether a string is an HTTP/HTTPS URL, with a stricter check for HTTPS-only.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Describes current project state, calendar UI requirements, known issues, and feature metadata."
}