{
  "backend/main.mo": "Motoko canister defining program, KPI, team, and agenda types with comparison utilities and embedded authorization mixin.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend files describing features, themes, and component behaviors.",
  "frontend/index.css": "Tailwind base/theme token definitions using OKLCH values for light and dark modes with SHQ navy/green palette.",
  "frontend/index.html": "Basic HTML root template loading the React application entry point.",
  "frontend/src/App.tsx": "Main app wrapper handling auth flow, theme provider, loading state, profile setup, and dashboard rendering.",
  "frontend/src/components/DashboardOverview.tsx": "Dashboard metrics and charts component computing program/KPI stats and rendering visualizations.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable delete confirmation dialog using AlertDialog components with Cancel/Delete actions.",
  "frontend/src/components/Footer.tsx": "Footer component with SHQ styling, dynamic year, and caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing logo, theme toggle, and user menu with profile and logout options.",
  "frontend/src/components/KpiFormDialog.tsx": "Dialog form for creating or editing a KPI, handling form state and submission to backend.",
  "frontend/src/components/KPIsTab.tsx": "KPI management interface with filtering, listing, and edit/delete actions based on user role.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter their name and role before accessing the app.",
  "frontend/src/components/program-calendar/CalendarCategoryLegend.tsx": "Shows a legend of calendar categories with color indicators for programs, agenda, and KPI deadlines.",
  "frontend/src/components/program-calendar/calendarCategoryUtils.ts": "Defines category colors and computes per-day counts for programs, agenda items, and KPI deadlines.",
  "frontend/src/components/program-calendar/CalendarTabErrorBoundary.tsx": "Provides an error boundary for the calendar tab with a reset option and fallback UI.",
  "frontend/src/components/program-calendar/DayCell.tsx": "Renders a calendar day cell showing date, visual indicators for category counts, and responsive layout.",
  "frontend/src/components/program-calendar/DayDetailPanel.tsx": "Displays a side or bottom sheet listing programs occurring on a selected day with click handling.",
  "frontend/src/components/program-calendar/GridDensityControl.tsx": "Offers controls to switch between compact and comfortable calendar grid spacing.",
  "frontend/src/components/program-calendar/ProgramCalendarViewSwitcher.tsx": "Provides buttons to switch calendar view modes such as month, week, day, or agenda.",
  "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx": "Shows detailed program information in a drawer with optional edit actions.",
  "frontend/src/components/program-calendar/programFilterUtils.ts": "Provides filtering utilities for programs and counts programs active on a specific day using safe date checks.",
  "frontend/src/components/program-calendar/statusPriorityStyles.ts": "Maps program status and priority values to display configs including labels, variants, and CSS classes.",
  "frontend/src/components/program-calendar/views/AgendaListView.tsx": "Builds a 14‑day agenda list grouping programs, agenda items, and KPI deadlines by day and rendering them with status and priority indicators.",
  "frontend/src/components/program-calendar/views/DayListView.tsx": "Displays all programs, agenda items, and KPIs for a single day with badges and detailed program info.",
  "frontend/src/components/program-calendar/views/MonthGridView.tsx": "Renders a month grid calendar and computes daily counts of programs, agenda items, and KPIs for each date cell.",
  "frontend/src/components/program-calendar/views/WeekGridView.tsx": "Shows a week‑grid calendar view with per‑day category counts and clickable day cells.",
  "frontend/src/components/ProgramCalendarTab.tsx": "Main calendar UI for viewing, filtering, and managing programs with multiple view modes and reminders.",
  "frontend/src/components/ProgramCalendarTabBoundary.tsx": "Error boundary wrapper that catches calendar errors and provides a retry mechanism with query invalidation.",
  "frontend/src/components/ProgramFormDialog.tsx": "Dialog form for creating or editing a program, handling form state, validation, and mutation submissions.",
  "frontend/src/components/programs/ProgramListItemCard.tsx": "Card component displaying program details, priority/status badges, and edit/delete actions with click‑to‑view behavior.",
  "frontend/src/components/ProgramsTab.tsx": "Programs listing tab with search, filtering, sorting, and CRUD actions including form and detail dialogs.",
  "frontend/src/components/RelatedProgramCombobox.tsx": "Popover combobox for selecting a related program from a searchable list.",
  "frontend/src/components/ReportsTab.tsx": "Reports interface for filtering programs/KPIs and exporting data to CSV.",
  "frontend/src/components/team/ManagerSelect.tsx": "Dropdown selector for choosing a manager, excluding the current member and supporting a 'no manager' option.",
  "frontend/src/components/team/PhotoUrlPreview.tsx": "Previews a user photo from a URL, handling loading states and errors with avatar fallback and indicators.",
  "frontend/src/components/team/TeamFunctionalMemberNode.tsx": "Clickable member node showing avatar, initials fallback, and basic info, highlighting selection state.",
  "frontend/src/components/team/TeamMemberCard.tsx": "Card component showing a team member with avatar upload support, edit/delete callbacks, and mutation-based avatar updates.",
  "frontend/src/components/team/TeamMemberDetailsPanel.tsx": "Side panel displaying detailed info about a team member, including manager and direct reports.",
  "frontend/src/components/team/TeamStructureNode.tsx": "Recursive component rendering a hierarchical org-chart node with avatar, role, and child connectors.",
  "frontend/src/components/team/TeamStructureView.tsx": "Builds and displays the functional team structure with hierarchy warnings and a details panel for selected members.",
  "frontend/src/components/TeamMemberFormDialog.tsx": "Dialog form for creating or editing team members, including avatar upload and validation.",
  "frontend/src/components/TeamMembersTab.tsx": "Team members management tab with filtering, card/structure views, and create/edit/delete actions.",
  "frontend/src/components/TopPillNav.tsx": "Renders a top pill-style navigation bar with tabs, including an additional Users tab for admins.",
  "frontend/src/components/UserProfilesTab.tsx": "Displays and manages user profiles with role editing, restricted to admins with loading and empty states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useCalendarReminders.ts": "Interval-based reminder system triggering toast notifications for upcoming programs, agenda items, and KPI deadlines.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity React context and provider using Dfinity AuthClient, handling login, identity loading, and status flags.",
  "frontend/src/hooks/useMediaQuery.ts": "Provides a hook that listens to a CSS media query and returns whether it currently matches.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, programs, KPIs, and admin checks via an actor API.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and theme variables for light and dark modes, including gradients and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app using QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Renders the dashboard with tabs for programs, KPIs, reports, and admin-only user profiles, using layout components and admin checks.",
  "frontend/src/pages/LoginPage.tsx": "Displays a styled login card allowing users to authenticate via Internet Identity with loading feedback.",
  "frontend/src/utils/imageNormalize.ts": "Provides an image normalization utility that resizes, compresses, validates, and converts images before upload, rejecting unsupported formats.",
  "frontend/src/utils/imageUpload.ts": "Handles client-side image normalization and uploads using ImgBB or Imgur with fallbacks and progress tracking.",
  "frontend/src/utils/reminderDedup.ts": "Tracks shown reminders in localStorage with expiry-based deduping and utilities to mark or check reminders.",
  "frontend/src/utils/safeBrowserStorage.ts": "Provides safe wrappers around localStorage operations with JSON and string helpers and fallback handling.",
  "frontend/src/utils/teamFunctionalStructure.ts": "Collects hierarchy members, groups them by division, and offers non-mutating name sorting utilities.",
  "frontend/src/utils/teamHierarchy.ts": "Builds a team hierarchy tree, detecting orphans, cycles, and invalid manager references with warnings.",
  "frontend/src/utils/urlParams.ts": "Extracts, stores, retrieves, and clears URL and session parameters, supporting hash-based routing.",
  "frontend/src/utils/urlValidation.ts": "Validates general HTTP/HTTPS URLs and HTTPS-only URLs using URL parsing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins including typography and container queries.",
  "project_state.json": "Describes the current project state including UI theming updates, detailed calendar UI requirements, known issues with dropdowns, scrolling, and photo uploads, and a list of existing features. Serves as a versioned specification and issue log for ongoing development."
}