{
  "backend/main.mo": "Main Motoko actor defining Program, KPI, TeamMember, and Agenda types with storage mixins, access control, and comparison/sorting utilities for programs and KPIs by priority, status, and date.",
  "feature_evidence.json": "Feature evidence report documenting five KPI form fixes: invalid record error resolution, proper numeric typing for target/realization values, and correct dropdown mapping for related programs and team members.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including hooks, pages, and UI elements with navy/green theming, KPI/program management, and enhanced validation/error handling details.",
  "frontend/.deploy-trigger": "Deployment marker file used to trigger CI/CD rebuilds without code changes, timestamped 2026-02-15.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining navy gradient backgrounds, light/dark theme variables, and SHQ brand styling with light green accents.",
  "frontend/index.html": "HTML entry point for the Program Timeline and Team KPI Tracking Application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component managing authentication flow with Internet Identity, profile setup modal, and conditional rendering of login or dashboard with navy-themed loading states.",
  "frontend/src/components/DashboardOverview.tsx": "Dashboard overview displaying program and KPI metrics with bar charts, progress indicators, and top 5 programs list using backend-calculated progress values.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable alert dialog component for delete confirmations with Cancel and Delete action buttons.",
  "frontend/src/components/Footer.tsx": "Application footer with copyright, caffeine.ai attribution link with UTM tracking, and accent-colored heart icon.",
  "frontend/src/components/Header.tsx": "Application header component with logo, title, theme toggle, and user profile dropdown menu that displays user info, role, and logout functionality.",
  "frontend/src/components/KpiFormDialog.tsx": "Dialog form for creating and editing KPIs with validation for name, program, team member, target/realization values, period, and status fields.",
  "frontend/src/components/KPIsTab.tsx": "KPI management tab with filtering, search, and table display of KPIs including status badges, progress bars, and CRUD operations (create, edit, delete) with role-based permissions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name and role selection (coordinator or viewer) with non-dismissible overlay.",
  "frontend/src/components/program-calendar/CalendarCategoryLegend.tsx": "Legend component displaying color-coded categories (Programs, Team Agenda, KPI Deadlines) for the calendar view.",
  "frontend/src/components/program-calendar/calendarCategoryUtils.ts": "Utility functions for calendar category colors and computing daily counts of programs, agenda items, and KPI deadlines across date ranges.",
  "frontend/src/components/program-calendar/CalendarTabErrorBoundary.tsx": "Error boundary component that catches and displays calendar tab errors with a reset button.",
  "frontend/src/components/program-calendar/DayCell.tsx": "Calendar day cell component showing date and category indicators (colored bars) with support for comfortable/compact density modes.",
  "frontend/src/components/program-calendar/DayDetailPanel.tsx": "Side sheet panel displaying all programs scheduled for a selected day with status, priority badges, and click-to-view details.",
  "frontend/src/components/program-calendar/GridDensityControl.tsx": "Toggle control for switching calendar grid density between comfortable and compact spacing modes.",
  "frontend/src/components/program-calendar/ProgramCalendarViewSwitcher.tsx": "View mode switcher component with buttons for Month, Week, Day, and Agenda calendar views.",
  "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx": "Side drawer displaying detailed program information including status, priority, description, timeline, progress, and optional edit button.",
  "frontend/src/components/program-calendar/programFilterUtils.ts": "Provides utility functions to filter programs by division, PIC, status, and priority, and to count programs overlapping a given day with safe error handling.",
  "frontend/src/components/program-calendar/statusPriorityStyles.ts": "Exports configuration functions that map program status and priority values to UI labels, variants, and Tailwind CSS classes for consistent badge styling.",
  "frontend/src/components/program-calendar/views/AgendaListView.tsx": "Displays a 14-day agenda list view grouping programs, team agenda items, and KPI deadlines by day with clickable program cards showing status and priority badges.",
  "frontend/src/components/program-calendar/views/DayListView.tsx": "Renders a single-day list view showing all programs, agenda items, and KPI deadlines for the selected date with clickable program cards.",
  "frontend/src/components/program-calendar/views/MonthGridView.tsx": "Displays a month calendar grid with weekday headers and day cells showing category counts for programs, agenda items, and KPIs with configurable density.",
  "frontend/src/components/program-calendar/views/WeekGridView.tsx": "Renders a week grid view with seven day cells showing category counts for programs, agenda items, and KPIs with configurable density.",
  "frontend/src/components/ProgramCalendarTab.tsx": "Main calendar view component with multiple view modes (month, week, day, agenda), filtering by division/PIC/status/priority, and integration with reminders, program details, and agenda items.",
  "frontend/src/components/ProgramCalendarTabBoundary.tsx": "Error boundary wrapper for the calendar tab that catches rendering errors, displays fallback UI with error details, and provides reset functionality with query invalidation.",
  "frontend/src/components/ProgramFormDialog.tsx": "Dialog component for creating and editing programs with form fields for name, description, division, person in charge, dates, status, progress, and priority. Fetches divisions and team members dynamically and handles form submission via create/update mutations.",
  "frontend/src/components/programs/ProgramListItemCard.tsx": "A clickable card component displaying program details including title, description, status/priority badges, dates, division, and PIC with edit/delete actions for authorized users.",
  "frontend/src/components/ProgramsTab.tsx": "Main programs list view with search, filtering by status/priority/division, and sorting capabilities. Provides add/edit/delete/view actions with role-based permissions and integrates ProgramFormDialog, DeleteConfirmDialog, and ProgramDetailDrawer.",
  "frontend/src/components/RelatedProgramCombobox.tsx": "Combobox component for selecting a related program from a list with search functionality. Uses Radix UI Command and Popover primitives to display and filter programs.",
  "frontend/src/components/ReportsTab.tsx": "Reports view that allows filtering programs and KPIs by team, division, and priority, then exporting filtered data to CSV format. Includes summary statistics and export functionality with localized labels.",
  "frontend/src/components/team/ManagerSelect.tsx": "A select dropdown component for choosing a team member's manager from available team members, with an option for no manager (Director level).",
  "frontend/src/components/team/PhotoUrlPreview.tsx": "Displays a preview of a team member's photo URL with avatar, loading state, and error handling showing success/failure indicators.",
  "frontend/src/components/team/TeamFunctionalMemberNode.tsx": "A selectable button component displaying a team member with avatar, name, and role in a compact layout for functional org chart views.",
  "frontend/src/components/team/TeamMemberCard.tsx": "Card component displaying a team member with avatar, name, role, division badge, and optional edit/delete actions. Supports avatar upload with progress tracking and authentication checks.",
  "frontend/src/components/team/TeamMemberDetailsPanel.tsx": "Side sheet panel showing detailed team member information including avatar, role, division, manager relationship, and direct reports list with avatars.",
  "frontend/src/components/team/TeamStructureNode.tsx": "Recursive tree node component for hierarchical org chart visualization, displaying a team member with avatar and connecting lines to child nodes.",
  "frontend/src/components/team/TeamStructureView.tsx": "Main organizational structure view displaying team hierarchy with director at top and division-grouped members below. Shows warnings for hierarchy issues and orphaned members.",
  "frontend/src/components/TeamMemberFormDialog.tsx": "Dialog for creating/editing team members with fields for name, division, role, manager, and avatar photo upload. Handles avatar upload with progress tracking and integrates with backend blob storage.",
  "frontend/src/components/TeamMembersTab.tsx": "Team members management view with search, add/edit/delete actions, and toggle between cards and structure views. Implements role-based permissions for editing and photo management.",
  "frontend/src/components/TopPillNav.tsx": "Navigation component rendering pill-style tabs for Dashboard, Calendar, Program, KPI, Team, Reports, and conditionally Users (admin only).",
  "frontend/src/components/UserProfilesTab.tsx": "Admin-only tab for managing user profiles and roles, displaying a table of users with role selection dropdowns and permission checks.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCalendarReminders.ts": "Hook that checks programs, agenda items, and KPI deadlines every interval, showing toast reminders at 24-hour and 3-hour thresholds using deduplication to prevent repeat notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMediaQuery.ts": "Custom React hook that tracks CSS media query matches with cross-browser support for responsive design.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, programs, KPIs, team members, agenda items, and admin functions with optimistic updates and error handling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using navy and green color schemes, plus utility classes for gradients and animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabbed navigation for overview, calendar, programs, KPIs, team members, reports, and admin user management.",
  "frontend/src/pages/LoginPage.tsx": "Login page component displaying Internet Identity authentication button with loading states and application description.",
  "frontend/src/utils/imageNormalize.ts": "Client-side image processing utility that resizes, compresses, and converts images to JPEG/PNG with HEIC detection and size validation for reliable uploads.",
  "frontend/src/utils/imageUpload.ts": "Deprecated utility for uploading images to ImgBB with client-side normalization and progress tracking. Team member photos should now use backend blob storage instead.",
  "frontend/src/utils/reminderDedup.ts": "Manages calendar reminder deduplication using localStorage with 48-hour expiry, tracking which reminders have been shown by category, item ID, and lead time.",
  "frontend/src/utils/safeBrowserStorage.ts": "Provides safe localStorage wrapper functions with fallback handling for restricted environments, supporting JSON and string storage operations.",
  "frontend/src/utils/teamFunctionalStructure.ts": "Utilities for collecting team members from hierarchy trees, grouping them by division, and sorting by name for functional organizational views.",
  "frontend/src/utils/teamHierarchy.ts": "Builds hierarchical tree structures from flat team member lists, detects circular references, and identifies orphaned nodes and multiple root issues.",
  "frontend/src/utils/teamMemberAvatar.ts": "Extracts displayable avatar URLs from TeamMemberWithAvatar objects, supporting ExternalBlob direct URLs and legacy string URLs.",
  "frontend/src/utils/teamMemberAvatarUpload.ts": "Uploads team member avatars to backend blob storage by normalizing images (resize to 800x800, JPEG compression) and converting to ExternalBlob with progress tracking.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage support and parameter cleanup functions.",
  "frontend/src/utils/urlValidation.ts": "Validates URL strings for HTTP/HTTPS protocols with separate functions for any secure protocol or HTTPS-only validation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme tokens for sidebar/chart/card components, container queries, typography, and animation plugins.",
  "project_state.json": "Project state file for Sistem Tracking SHQ AQL tracking KPI form validation issues. Documents six feature requests to fix 'invalid record' errors by ensuring proper data type serialization (numbers vs strings) and correct dropdown mapping between frontend and backend."
}