{
  "backend/main.mo": "Defines types for programs, KPIs, users, and teams plus comparison utilities, and sets up authorization via an access control mixin.",
  "feature_evidence.json": "Lists implemented features with associated files, components, test IDs, and confidence metadata for build verification.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries for many frontend files used for build planning.",
  "frontend/index.css": "Tailwind base/theme variables defining OKLCH color tokens for light and dark modes and global style resets.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level app component handling auth, profile setup, theme, and routing to Dashboard.",
  "frontend/src/components/DashboardOverview.tsx": "Dashboard metrics and charts computed from programs and KPIs with loading skeletons and visual summaries.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable delete confirmation dialog using AlertDialog with Cancel/Delete actions.",
  "frontend/src/components/Footer.tsx": "Simple footer with branding, copyright, and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the main header with logo, theme toggle, user profile dropdown, and logout handling. Fetches user data and displays initials, name, and role.",
  "frontend/src/components/KpiFormDialog.tsx": "Provides a form dialog for creating or editing KPI entries, initializing form state and submitting data via mutations. Handles related program and team member selection.",
  "frontend/src/components/KPIsTab.tsx": "Displays and filters KPI data with search, status, period, and team filters. Supports creating, editing, and deleting KPIs based on user permissions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a mandatory modal for first‑time users to enter their name and role. Saves the profile using a mutation and disables closing until completion.",
  "frontend/src/components/program-calendar/CalendarCategoryLegend.tsx": "Renders a legend showing color-coded calendar categories.",
  "frontend/src/components/program-calendar/calendarCategoryUtils.ts": "Utilities for category colors and computing per-day counts for programs, agendas, and KPIs.",
  "frontend/src/components/program-calendar/CalendarTabErrorBoundary.tsx": "Error boundary that displays a fallback UI and reset button when the calendar view fails.",
  "frontend/src/components/program-calendar/DayCell.tsx": "Clickable calendar day cell showing date and category indicators with density options.",
  "frontend/src/components/program-calendar/DayDetailPanel.tsx": "Side or bottom panel listing programs active on a selected day with details and click handling.",
  "frontend/src/components/program-calendar/GridDensityControl.tsx": "Toggle buttons to switch between comfortable and compact calendar grid density.",
  "frontend/src/components/program-calendar/ProgramCalendarViewSwitcher.tsx": "Button group to switch between month, week, day, and agenda calendar views.",
  "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx": "Drawer displaying full program details with optional edit action.",
  "frontend/src/components/program-calendar/programFilterUtils.ts": "Functions to filter programs by fields and count programs active on a given day.",
  "frontend/src/components/program-calendar/statusPriorityStyles.ts": "Maps status and priority values to display labels and style configs.",
  "frontend/src/components/program-calendar/views/AgendaListView.tsx": "Builds a 14‑day agenda list by grouping programs, agenda items, and KPIs by day and rendering them with click handling.",
  "frontend/src/components/program-calendar/views/DayListView.tsx": "Filters and displays all programs, agenda items, and KPIs occurring on a single day with badges and program click support.",
  "frontend/src/components/program-calendar/views/MonthGridView.tsx": "Generates a month grid with per‑day counts of programs, agenda items, and KPIs and renders them via DayCell components.",
  "frontend/src/components/program-calendar/views/WeekGridView.tsx": "Builds a week grid view showing daily category counts and clickable DayCell entries.",
  "frontend/src/components/ProgramCalendarTab.tsx": "Implements a full program calendar with month, week, day, and agenda views, filters, reminders, and program editing. Computes visible ranges and loads calendar data based on view mode.",
  "frontend/src/components/ProgramCalendarTabBoundary.tsx": "Wraps the calendar tab with an error boundary that shows a fallback UI and allows retrying. On reset, invalidates calendar‑related queries and reloads the tab.",
  "frontend/src/components/ProgramFormDialog.tsx": "Dialog form for creating or editing a program, managing form state, loading team members by division, and submitting mutations.",
  "frontend/src/components/programs/ProgramListItemCard.tsx": "Renders a program card with description, priority/status badges, details, and edit/delete/view actions.",
  "frontend/src/components/ProgramsTab.tsx": "Programs overview tab with filtering, sorting, search, and actions to view, edit, create, or delete programs.",
  "frontend/src/components/RelatedProgramCombobox.tsx": "Popover-based combobox letting users search and select a related program from a list.",
  "frontend/src/components/ReportsTab.tsx": "Reports tab that filters programs and KPIs by team, division, and priority, and supports exporting report data.",
  "frontend/src/components/team/ManagerSelect.tsx": "Provides a select dropdown to choose a manager, excluding the current member and supporting 'no manager' selection.",
  "frontend/src/components/team/PhotoUrlPreview.tsx": "Previews a remote photo URL with avatar fallback, load/error state, and basic validation.",
  "frontend/src/components/team/TeamFunctionalMemberNode.tsx": "Displays a selectable team member node with avatar/initials and name/role text.",
  "frontend/src/components/team/TeamMemberCard.tsx": "Displays a team member card with avatar upload, edit/delete handlers, and photo validation using upload progress tracking.",
  "frontend/src/components/team/TeamMemberDetailsPanel.tsx": "Shows a slide-out panel with full team member details, including manager and direct reports.",
  "frontend/src/components/team/TeamStructureNode.tsx": "Renders a hierarchical organization node with selectable member info and recursively drawn child nodes.",
  "frontend/src/components/team/TeamStructureView.tsx": "Builds and displays a functional team structure with hierarchy warnings and a member detail panel.",
  "frontend/src/components/TeamMemberFormDialog.tsx": "Dialog form for creating or editing a team member, including avatar upload, manager selection, and validation.",
  "frontend/src/components/TeamMembersTab.tsx": "Team members management tab with search, filtering, card/structure views, and create/edit/delete actions.",
  "frontend/src/components/UserProfilesTab.tsx": "Admin-only UI to list user profiles and change their roles with loading and permission states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useCalendarReminders.ts": "Periodically checks programs, agenda items, and KPI deadlines to trigger deduplicated time-based toast reminders.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useMediaQuery.ts": "React hook that returns whether a given CSS media query matches, with event-listener updates.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with backend actors to manage user profiles, admin actions, programs, KPIs, and related data.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode values, and custom utility classes like gradients and animations.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and the Internet Identity provider before rendering the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page rendering tabs for overview, calendar, programs, KPIs, team, reports, and user management depending on admin status.",
  "frontend/src/pages/LoginPage.tsx": "Login page with UI for initiating Internet Identity login and displaying login progress.",
  "frontend/src/utils/imageUpload.ts": "Utility for uploading images to ImgBB or Imgur with size checks, progress reporting, and fallback handling.",
  "frontend/src/utils/reminderDedup.ts": "Manages deduplication of shown reminders using localStorage with 48‑hour expiry and utilities to check or mark reminders.",
  "frontend/src/utils/safeBrowserStorage.ts": "Provides safe wrappers around localStorage and sessionStorage for JSON and string values with graceful fallbacks.",
  "frontend/src/utils/teamFunctionalStructure.ts": "Collects hierarchy members, groups them by division, and offers name‑sorting utilities.",
  "frontend/src/utils/teamHierarchy.ts": "Builds a team hierarchy with cycle and missing‑manager detection, returning roots, orphans, and warnings.",
  "frontend/src/utils/urlParams.ts": "Handles reading URL parameters, persisting them in sessionStorage, and clearing them from hash routing.",
  "frontend/src/utils/urlValidation.ts": "Validates HTTP/HTTPS URLs, including a strict HTTPS‑only check.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining colors, spacing, animations, and plugin setup.",
  "project_state.json": "Project state file listing calendar UX requirements, known issues, and existing features for planning."
}