{
  "backend/main.mo": "Defines actor with authorization mixin and data types for programs, KPIs, team members, agendas, and comparison helpers for sorting.",
  "feature_evidence.json": "Lists feature evidence entries describing frontend changes related to team member photo upload and cleanup of URL logic.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend components, hooks, and pages for reference.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color variables, themes, and global styling rules.",
  "frontend/index.html": "HTML entry point that mounts the app root and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app component handling authentication, profile setup gating, theming, and routing to the dashboard.",
  "frontend/src/components/DashboardOverview.tsx": "Dashboard metrics and charts component computing program/KPI statistics and rendering visual summaries with Recharts.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable delete confirmation dialog using alert-dialog UI components with cancel and delete actions.",
  "frontend/src/components/Footer.tsx": "Simple footer showing attribution text and link with decorative heart icon.",
  "frontend/src/components/Header.tsx": "Top navigation bar that shows logo, theme toggle, user profile menu, and handles logout with query cache clearing.",
  "frontend/src/components/KpiFormDialog.tsx": "Dialog form for creating or editing a KPI, including program selection, PIC assignment, and numeric KPI fields.",
  "frontend/src/components/KPIsTab.tsx": "KPI management view with search, filters, table display, and actions for creating, editing, and deleting KPIs.",
  "frontend/src/components/ProfileSetupModal.tsx": "Initial profile setup modal that collects a user's name and role and saves it to the backend.",
  "frontend/src/components/program-calendar/CalendarCategoryLegend.tsx": "Displays a color-coded legend for program, agenda, and KPI calendar categories.",
  "frontend/src/components/program-calendar/calendarCategoryUtils.ts": "Provides category colors and computes per-day counts for programs, agenda items, and KPI deadlines.",
  "frontend/src/components/program-calendar/CalendarTabErrorBoundary.tsx": "Provides an error boundary for calendar tabs with a reset option and fallback UI.",
  "frontend/src/components/program-calendar/DayCell.tsx": "Renders a calendar day cell showing date, category indicators, and visual states based on month, density, and activity.",
  "frontend/src/components/program-calendar/DayDetailPanel.tsx": "Shows a side panel listing programs active on a selected day with details and click handling.",
  "frontend/src/components/program-calendar/GridDensityControl.tsx": "Toggle buttons for switching calendar grid density between comfortable and compact.",
  "frontend/src/components/program-calendar/ProgramCalendarViewSwitcher.tsx": "Provides controls to switch calendar views between month, week, day, and agenda modes.",
  "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx": "Displays detailed information for a selected program with optional edit support in a drawer panel.",
  "frontend/src/components/program-calendar/programFilterUtils.ts": "Functions for filtering programs by criteria and counting programs active on a given day.",
  "frontend/src/components/program-calendar/statusPriorityStyles.ts": "Maps program status and priority values to display labels and styling configs.",
  "frontend/src/components/program-calendar/views/AgendaListView.tsx": "Builds a 14‑day grouped agenda list showing programs, agenda items, and KPI deadlines by day with click handling.",
  "frontend/src/components/program-calendar/views/DayListView.tsx": "Displays all programs, agenda items, and KPI deadlines for a single day with status and priority badges.",
  "frontend/src/components/program-calendar/views/MonthGridView.tsx": "Renders a month grid calendar and computes category counts per day for the visual day cells.",
  "frontend/src/components/program-calendar/views/WeekGridView.tsx": "Creates a week‑view grid with per‑day category counts using DayCell components.",
  "frontend/src/components/ProgramCalendarTab.tsx": "Comprehensive program calendar with month/week/day/agenda views, filters, reminders, and program detail/edit panels.",
  "frontend/src/components/ProgramCalendarTabBoundary.tsx": "Error boundary wrapper for the program calendar that displays a fallback UI and resets related queries on retry.",
  "frontend/src/components/ProgramFormDialog.tsx": "Modal form for creating or editing a program, handling form state, validation, and submission via create/update queries.",
  "frontend/src/components/programs/ProgramListItemCard.tsx": "Card component showing program details, priority/status badges, and edit/delete actions.",
  "frontend/src/components/ProgramsTab.tsx": "Displays and filters a list of programs with search, sorting, CRUD actions, and program detail viewing.",
  "frontend/src/components/RelatedProgramCombobox.tsx": "Combobox popover for selecting a related program with search and selection handling.",
  "frontend/src/components/ReportsTab.tsx": "Generates filtered program or KPI reports and supports exporting data to CSV.",
  "frontend/src/components/team/ManagerSelect.tsx": "Dropdown for selecting a manager, excluding the current member and handling undefined values.",
  "frontend/src/components/team/PhotoUrlPreview.tsx": "Previews a photo URL with avatar fallback and error handling indicating load success or failure.",
  "frontend/src/components/team/TeamMemberCard.tsx": "Displays a team member’s avatar, details, and optional edit/delete buttons in a card layout.",
  "frontend/src/components/team/TeamMemberDetailsPanel.tsx": "Displays a detailed side panel for a selected team member, showing avatar, role, manager, and direct reports with edit and close actions.",
  "frontend/src/components/team/TeamStructureNode.tsx": "Renders a hierarchical team node with selectable member info and recursively displays child nodes.",
  "frontend/src/components/team/TeamStructureView.tsx": "Builds and displays the org chart with hierarchy warnings and a details panel for selected members.",
  "frontend/src/components/TeamMemberFormDialog.tsx": "Modal form for creating or editing team members, including avatar upload, validation, and manager selection.",
  "frontend/src/components/TeamMembersTab.tsx": "Lists team members with search, filtering, structure view, and supports creating, editing, and deleting members.",
  "frontend/src/components/UserProfilesTab.tsx": "Renders an admin-only user profile management table with role editing, loading states, and access checks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCalendarReminders.ts": "Periodically checks programs, agenda items, and KPI deadlines to trigger deduplicated 24h and 3h reminder toasts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and identity state management.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks whether a CSS media query matches using window.matchMedia with listener setup and cleanup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, admin actions, program data, and date‑range program queries using an actor API.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, theme variables for light/dark modes, and utility animations and effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tab navigation, loading different sections and conditionally showing admin tabs.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login screen using Internet Identity with loading states and styled UI components.",
  "frontend/src/utils/imageUpload.ts": "Implements ImgBB image upload with validation, progress tracking, and base64 conversion.",
  "frontend/src/utils/reminderDedup.ts": "Manages local reminder deduplication with timestamped records and automatic expiry cleanup.",
  "frontend/src/utils/safeBrowserStorage.ts": "Wraps localStorage access with safe get/set helpers and fallbacks for restricted environments.",
  "frontend/src/utils/teamHierarchy.ts": "Builds a tree of team members, detects cycles or missing managers, and reports orphan nodes and warnings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/urlValidation.ts": "Validates that a string is a properly formatted HTTP or HTTPS URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Defines current project state, including calendar UX goals, issues, and feature metadata."
}