{
  "backend/main.mo": "Defines core data types for programs, KPIs, users, and agendas, and provides comparison utilities along with integrated authorization mixin.",
  "feature_evidence.json": "Lists feature evidence entries mapping UI changes to affected frontend files, components, and related requirements.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing their functionality across the app.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH-based light/dark theme variables for the application.",
  "frontend/index.html": "Simple HTML entry point that mounts the React app and loads the main script.",
  "frontend/src/App.tsx": "Handles authentication flow, profile setup gating, and renders either login, setup modal, or dashboard.",
  "frontend/src/components/DashboardOverview.tsx": "Displays program and KPI metrics with charts, progress data, and loading skeletons.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable confirmation dialog component for delete actions.",
  "frontend/src/components/Footer.tsx": "Simple footer with attribution and external link branding.",
  "frontend/src/components/Header.tsx": "Renders the app header with logo, user info, theme toggle, and logout handling using user profile and identity hooks.",
  "frontend/src/components/KpiFormDialog.tsx": "Provides a dialog form for creating or updating a KPI, handling form state, validation, and mutation submissions.",
  "frontend/src/components/KPIsTab.tsx": "Displays KPI management table with filtering, creation, editing, and deletion logic, using KPI- and program-related queries.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a mandatory modal for new users to enter their name and role, then saves the profile via a mutation.",
  "frontend/src/components/program-calendar/CalendarCategoryLegend.tsx": "Shows a small legend mapping calendar event categories to their display colors.",
  "frontend/src/components/program-calendar/calendarCategoryUtils.ts": "Utility functions for category colors and counting program, agenda, and KPI occurrences per day.",
  "frontend/src/components/program-calendar/DayCell.tsx": "Renders a clickable calendar day cell showing the date and category color bars based on program, agenda, and KPI counts.",
  "frontend/src/components/program-calendar/DayDetailPanel.tsx": "Displays a side or bottom sheet listing all programs active on a selected day with status, priority, and basic details.",
  "frontend/src/components/program-calendar/GridDensityControl.tsx": "Provides buttons to toggle between comfortable and compact calendar grid spacing.",
  "frontend/src/components/program-calendar/ProgramCalendarViewSwitcher.tsx": "Button group allowing users to switch between month, week, day, and agenda calendar views.",
  "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx": "Shows detailed program information in a drawer, including timeline, PIC info, status, priority, and edit support.",
  "frontend/src/components/program-calendar/programFilterUtils.ts": "Provides filtering logic for programs and a helper to count active programs on a given day.",
  "frontend/src/components/program-calendar/statusPriorityStyles.ts": "Maps status and priority values to display labels and style configurations.",
  "frontend/src/components/program-calendar/views/AgendaListView.tsx": "Generates a 14‑day agenda list combining programs, agenda items, and KPIs, grouped by day with click handling for programs.",
  "frontend/src/components/program-calendar/views/DayListView.tsx": "Builds a day view list by collecting and sorting programs, agenda items, and KPI deadlines occurring on the selected date and renders them with basic metadata.",
  "frontend/src/components/program-calendar/views/MonthGridView.tsx": "Generates a full month grid with weekday headers and day cells, computing per‑day category counts for programs, agenda, and KPIs.",
  "frontend/src/components/program-calendar/views/WeekGridView.tsx": "Creates a week grid view by listing each day of the week and displaying category counts for programs, agenda, and KPIs.",
  "frontend/src/components/ProgramCalendarTab.tsx": "Implements a program calendar with multiple views, filtering, reminders, and range-based data queries for programs, agendas, and KPIs.",
  "frontend/src/components/ProgramFormDialog.tsx": "Form dialog for creating or editing a program, managing form state and submitting mutations with division-based PIC selection.",
  "frontend/src/components/programs/ProgramListItemCard.tsx": "Renders a clickable program card with priority/status badges, details, and optional edit/delete actions.",
  "frontend/src/components/ProgramsTab.tsx": "Provides a programs management interface with search, filters, sorting, CRUD operations, and detail viewing via dialogs and drawers.",
  "frontend/src/components/RelatedProgramCombobox.tsx": "Renders a searchable popover combobox for selecting a related program from a provided list.",
  "frontend/src/components/ReportsTab.tsx": "Generates filtered program and KPI reports with export functionality and dynamic team/division filters.",
  "frontend/src/components/TeamMemberFormDialog.tsx": "Dialog form for creating or editing team members, handling submit logic for both modes.",
  "frontend/src/components/TeamMembersTab.tsx": "Displays and filters team members with search, division filters, and create/edit/delete actions.",
  "frontend/src/components/UserProfilesTab.tsx": "Admin-only interface for listing users and updating their roles with validation and loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and maintains a backend actor tied to the user’s Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useCalendarReminders.ts": "Periodically checks upcoming program, agenda, and KPI times to trigger deduplicated toast reminders at 24h and 3h intervals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for managing Internet Identity authentication, including login, logout, and persisted identity loading.",
  "frontend/src/hooks/useMediaQuery.ts": "Returns a boolean indicating whether a given CSS media query currently matches, updating reactively on changes.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch and mutate user profiles, roles, admin status, and programs via an actor API.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode styles, and utility animations for UI styling.",
  "frontend/src/main.tsx": "Initializes the React app with Internet Identity and React Query providers and mounts it to the DOM.",
  "frontend/src/pages/Dashboard.tsx": "Renders the dashboard with tabbed navigation, conditionally showing admin tabs based on caller permissions.",
  "frontend/src/pages/LoginPage.tsx": "Implements a login screen using Internet Identity with styled components and loading feedback.",
  "frontend/src/utils/reminderDedup.ts": "Handles deduplication of calendar reminders using localStorage with timestamp-based expiry.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugin integrations for the project.",
  "project_state.json": "Defines the current project state for redesigning the Program Calendar, including UX goals, architectural notes, known issues, and a list of existing calendar‑related features. Serves as a planning reference for UI improvements, data wiring, and interaction requirements."
}