{
  "backend/main.mo": "Defines program, KPI, and user role types with comparison utilities and includes authorization mixin for access‑controlled actor logic.",
  "feature_evidence.json": "Describes a feature request for adding a smooth open/close transition to the ProgramDetailDrawer component and lists related files and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files, detailing their roles in the application UI and logic.",
  "frontend/index.css": "Defines global Tailwind base styles, theme variables, and light/dark color tokens for the frontend.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Controls authentication flow, profile setup handling, and rendering of the dashboard within a theme provider.",
  "frontend/src/components/DashboardOverview.tsx": "Computes program and KPI metrics and renders multiple status and progress charts with loading skeletons.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable alert dialog component for confirming delete actions.",
  "frontend/src/components/Footer.tsx": "Footer component showing attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with logo, theme toggle, user menu, and logout handling tied to identity and query cache.",
  "frontend/src/components/KpiFormDialog.tsx": "Form dialog for creating or updating a KPI, handling related program, PIC selection, and status/period inputs.",
  "frontend/src/components/KPIsTab.tsx": "Displays KPI list with search and filters, and supports creating, editing, and deleting KPIs using dialogs.",
  "frontend/src/components/ProfileSetupModal.tsx": "Initial profile setup modal that lets users enter their name and select a role before continuing.",
  "frontend/src/components/program-calendar/DayCell.tsx": "A calendar day cell component showing the date, highlighting today, and displaying a count of programs for that day.",
  "frontend/src/components/program-calendar/DayDetailPanel.tsx": "Displays a slide-out panel showing all programs active on a selected day, with filtering by date range and clickable program cards.",
  "frontend/src/components/program-calendar/GridDensityControl.tsx": "Provides buttons to toggle between comfortable and compact calendar grid spacing.",
  "frontend/src/components/program-calendar/ProgramCalendarViewSwitcher.tsx": "Offers controls to switch the calendar view between month, week, and agenda modes.",
  "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx": "Shows a detailed drawer view of a selected program with status, priority, dates, and edit options.",
  "frontend/src/components/program-calendar/programFilterUtils.ts": "Contains utilities to filter programs by various fields and count programs active on a specific day.",
  "frontend/src/components/program-calendar/statusPriorityStyles.ts": "Maps program status and priority values to UI label and style configurations.",
  "frontend/src/components/program-calendar/views/AgendaListView.tsx": "Generates a 14‑day agenda list view showing programs grouped by day with clickable entries.",
  "frontend/src/components/program-calendar/views/MonthGridView.tsx": "Renders a month grid calendar view with day cells populated by matching programs.",
  "frontend/src/components/program-calendar/views/WeekGridView.tsx": "Renders a week grid view with labeled day columns and programs displayed in each day cell.",
  "frontend/src/components/ProgramCalendarTab.tsx": "Calendar interface for viewing and filtering programs by date range, division, PIC, status, and priority with multiple view modes.",
  "frontend/src/components/ProgramFormDialog.tsx": "Form dialog for creating or editing programs with division-based PIC selection, dates, status, and priority fields.",
  "frontend/src/components/programs/ProgramListItemCard.tsx": "Displays a card for a program with status/priority badges and edit, view, and delete actions.",
  "frontend/src/components/ProgramsTab.tsx": "Program list view with search, filters, sorting, and actions for viewing details, editing, and deleting programs.",
  "frontend/src/components/RelatedProgramCombobox.tsx": "A searchable popover combobox for selecting a related program, showing the current selection and handling disabled states.",
  "frontend/src/components/ReportsTab.tsx": "A reporting interface that fetches programs, KPIs, and team data, applies filters, and prepares exportable CSV reports.",
  "frontend/src/components/TeamMemberFormDialog.tsx": "A dialog form for creating or editing team members with validation and mutation handling.",
  "frontend/src/components/TeamMembersTab.tsx": "A management view for listing, filtering, searching, creating, editing, and deleting team members.",
  "frontend/src/components/UserProfilesTab.tsx": "An admin-only interface to list user profiles and change their roles with loading and access control states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/useMediaQuery.ts": "React hook that tracks whether a CSS media query currently matches.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, programs, and related data via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for themes, gradients, animations, and utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page with tabbed navigation for overview, calendar, programs, KPIs, reports, team, and user management.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login screen using Internet Identity with a centered card, branding icon, and a button that shows a loading state.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and handle hash‑based routing parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, spacing, shadows, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Stores project-wide state and design notes describing the planned Program Calendar redesign, requirements, issues, and feature metadata."
}