{
  "backend/main.mo": "Defines data types and comparison utilities for programs, KPIs, and priorities, and includes authorization mixin setup.",
  "feature_evidence.json": "Lists implemented features with associated files, components, tests, and confidence indicators.",
  "frontend-file-summaries.txt": "Provides textual summaries for various frontend files including components, pages, hooks, and styling.",
  "frontend/index.css": "Tailwind CSS setup defining OKLCH-based color variables for light and dark themes and global styling rules.",
  "frontend/index.html": "Base HTML file that loads the React application by mounting main.tsx into the root div.",
  "frontend/src/App.tsx": "Main app component handling authentication, user profile loading, theming, and conditional rendering of login, setup, or dashboard.",
  "frontend/src/components/DashboardOverview.tsx": "Dashboard overview component that fetches metrics and renders charts, stats, and progress data for programs and KPIs.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable confirmation dialog component for delete operations using alert-dialog UI components.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying attribution text with a link and heart icon.",
  "frontend/src/components/Header.tsx": "Renders the main app header with theme toggle, user profile display, and logout handling.",
  "frontend/src/components/KpiFormDialog.tsx": "Dialog form for creating or editing a KPI, mapping form inputs into backend-compatible payloads.",
  "frontend/src/components/KPIsTab.tsx": "Displays and filters KPI data with search, status, period, and team filters, plus edit and delete actions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Forces users to input name and role on first use and saves the profile.",
  "frontend/src/components/ProgramCalendarTab.tsx": "Shows a calendar and lists programs active on a selected date with status and priority badges.",
  "frontend/src/components/ProgramFormDialog.tsx": "Dialog for creating or updating a program, including PIC selection, dates, status, and priority.",
  "frontend/src/components/ProgramsTab.tsx": "Displays and filters program data with search, sorting, badges, and CRUD dialogs.",
  "frontend/src/components/ReportsTab.tsx": "Generates program and KPI reports with filtering options and CSV export.",
  "frontend/src/components/TeamMemberFormDialog.tsx": "Dialog for creating or updating team members with validation and form handling.",
  "frontend/src/components/TeamMembersTab.tsx": "Lists team members with search, filtering, and options to add, edit, or delete entries.",
  "frontend/src/components/UserProfilesTab.tsx": "Admin-only interface for viewing users and updating their roles.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and identity state loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, programs, KPIs, and admin data via an actor interface.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables, dark mode styles, and utility classes for gradients, animations, and card effects.",
  "frontend/src/main.tsx": "Initializes React app and wraps it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tabbed navigation, showing different sections based on user role and selected tab.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login screen allowing users to authenticate via Internet Identity with loading feedback.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content scanning, extended theme settings for colors, radius, shadows, animations, and includes typography, container query, and animation plugins.",
  "project_state.json": "Tracks project metadata including features, new feature requests, versions, and architectural/issue placeholders for a program calendar project."
}