{
  "backend/main.mo": "Defines core data types for programs, KPIs, users, and team members, and includes comparison utilities for sorting along with authorization mixins.",
  "feature_evidence.json": "Lists feature evidence entries linking feature IDs to affected files, components, and test IDs for build and verification tracking.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files describing their purpose within the application.",
  "frontend/index.css": "Defines global Tailwind CSS variables and theme styles for light and dark modes with custom color tokens.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup, and conditional rendering of the dashboard.",
  "frontend/src/components/DashboardOverview.tsx": "Dashboard metrics view computing program and KPI statistics and rendering charts and progress data.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable alert dialog component for confirming deletion actions.",
  "frontend/src/components/Footer.tsx": "Footer component showing attribution with a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the app header with logo, theme toggle, user profile display, and logout handling.",
  "frontend/src/components/KpiFormDialog.tsx": "Form dialog for creating or editing a KPI, including validation and mutation submission.",
  "frontend/src/components/KPIsTab.tsx": "Displays and filters KPI data with search, role-based editing, and dialogs for creating or deleting KPIs.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter name and role, then saves profile information.",
  "frontend/src/components/program-calendar/DayCell.tsx": "Calendar cell displaying a date with visual indicators for programs and styling for today, month context, and click actions.",
  "frontend/src/components/program-calendar/DayDetailPanel.tsx": "Shows a sheet with all programs active on a selected day and allows clicking a program for details.",
  "frontend/src/components/program-calendar/ProgramCalendarViewSwitcher.tsx": "Provides buttons to switch between month, week, and agenda calendar views.",
  "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx": "Displays detailed program information in a drawer with status, priority, dates, and unit info.",
  "frontend/src/components/program-calendar/programFilterUtils.ts": "Contains utilities to filter programs by fields and count programs active on a given day.",
  "frontend/src/components/program-calendar/statusPriorityStyles.ts": "Maps program status and priority values to display labels and styling classes.",
  "frontend/src/components/program-calendar/views/AgendaListView.tsx": "Generates a 14‑day agenda list showing programs per day with click-to-view support.",
  "frontend/src/components/program-calendar/views/MonthGridView.tsx": "Renders a month grid calendar highlighting programs active on each date.",
  "frontend/src/components/program-calendar/views/WeekGridView.tsx": "Renders a week grid view with daily program listings and date headers.",
  "frontend/src/components/ProgramCalendarTab.tsx": "Calendar interface for viewing programs by month, week, or agenda with filters and program detail interactions.",
  "frontend/src/components/ProgramFormDialog.tsx": "Form dialog for creating or editing a program, handling division-based PIC selection and data submission.",
  "frontend/src/components/ProgramsTab.tsx": "Displays and filters programs with search, sorting, status/priority/division filters, and supports creating, editing, and deleting programs.",
  "frontend/src/components/ReportsTab.tsx": "Generates filtered program or KPI reports by team, division, and priority, and supports exporting data to CSV.",
  "frontend/src/components/TeamMemberFormDialog.tsx": "Dialog for creating or editing a team member with validation and form submission via mutations.",
  "frontend/src/components/TeamMembersTab.tsx": "Lists, filters, and manages team members with search, division filter, and CRUD actions depending on user permissions.",
  "frontend/src/components/UserProfilesTab.tsx": "Admin-only interface for viewing user profiles and updating their roles with access control handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance that updates when the user's identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login flow, stored identities, and status flags.",
  "frontend/src/hooks/useMediaQuery.ts": "Defines a hook that returns whether a given CSS media query currently matches, updating reactively on window changes.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks wrapping backend actor calls for user profiles, admin checks, programs, and related mutations.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables, dark mode values, and utility classes for gradients, animations, and card effects.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tab navigation, showing different sections based on the active tab and admin status.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login screen that triggers Internet Identity login and shows loading state during authentication.",
  "frontend/src/utils/urlParams.ts": "Implements helpers for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind config defining dark mode, content paths, custom OKLCH color system, extended theme settings, animations, and plugin usage.",
  "project_state.json": "Project metadata describing redesign goals for the Program Calendar, including UI requirements, view modes, filters, and existing features."
}