{
  "backend/main.mo": "Defines program, KPI, user, and agenda types with comparison utilities and integrates authorization via access control state.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptions of multiple frontend files for documentation or planning purposes.",
  "frontend/index.css": "Sets Tailwind base layers and color variables for light and dark themes using OKLCH values.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Root component managing authentication, profile setup flow, theming, and loading states.",
  "frontend/src/components/DashboardOverview.tsx": "Renders dashboard metrics and charts by aggregating program and KPI data with loading placeholders.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Reusable confirmation dialog for delete actions using alert-dialog components.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header component showing logo, theme toggle, and user menu with logout and profile info.",
  "frontend/src/components/KpiFormDialog.tsx": "Dialog form for creating or editing a KPI, mapping form fields to backend structures and submitting mutations.",
  "frontend/src/components/KPIsTab.tsx": "Displays KPI list with filters, edit/delete actions, and modal handling for creating or editing KPIs.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter their name and role, then saving the profile via a mutation.",
  "frontend/src/components/program-calendar/CalendarCategoryLegend.tsx": "Renders a legend showing color indicators for calendar item categories.",
  "frontend/src/components/program-calendar/calendarCategoryUtils.ts": "Provides color mapping and daily counting logic for programs, agenda items, and KPIs.",
  "frontend/src/components/program-calendar/CalendarTabErrorBoundary.tsx": "React error boundary that catches rendering errors in the calendar tab and shows a resettable fallback UI.",
  "frontend/src/components/program-calendar/DayCell.tsx": "Renders a single calendar day cell with date, visual category indicators, and density-based styling.",
  "frontend/src/components/program-calendar/DayDetailPanel.tsx": "Displays a slide-in detail panel listing all programs occurring on a selected day with metadata and click handling.",
  "frontend/src/components/program-calendar/GridDensityControl.tsx": "UI toggle allowing users to switch between comfortable and compact grid spacing modes.",
  "frontend/src/components/program-calendar/ProgramCalendarViewSwitcher.tsx": "Switches calendar view modes (month, week, day, agenda) using a button group.",
  "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx": "Drawer showing detailed program information including status, timeline, PIC, and optional edit controls.",
  "frontend/src/components/program-calendar/programFilterUtils.ts": "Implements filter logic for programs and counts programs active on a specific day.",
  "frontend/src/components/program-calendar/statusPriorityStyles.ts": "Maps program status and priority values to display labels and style configurations.",
  "frontend/src/components/program-calendar/views/AgendaListView.tsx": "Generates a 14-day agenda list grouping programs, agenda items, and KPI deadlines by day.",
  "frontend/src/components/program-calendar/views/DayListView.tsx": "Renders a detailed day view listing programs, agenda items, and KPI deadlines filtered to the selected date with click handling.",
  "frontend/src/components/program-calendar/views/MonthGridView.tsx": "Builds a monthly calendar grid and displays per‑day counts of programs, agenda items, and KPIs using DayCell components.",
  "frontend/src/components/program-calendar/views/WeekGridView.tsx": "Displays a weekly calendar grid with weekday labels and per‑day item counts through DayCell components.",
  "frontend/src/components/ProgramCalendarTab.tsx": "Main calendar view with month/week/day/agenda modes, program filtering, reminders, and program detail/editing support.",
  "frontend/src/components/ProgramFormDialog.tsx": "Dialog form for creating or editing programs, handling division-based PIC selection and submitting mutations.",
  "frontend/src/components/programs/ProgramListItemCard.tsx": "Creates an interactive program card showing details, status, priority, and edit/delete actions.",
  "frontend/src/components/ProgramsTab.tsx": "Displays and filters programs with search, sorting, CRUD actions, and detail drawer support.",
  "frontend/src/components/RelatedProgramCombobox.tsx": "Provides a searchable combobox to select a related program from a list.",
  "frontend/src/components/ReportsTab.tsx": "Generates program or KPI reports with filters and CSV export functionality.",
  "frontend/src/components/TeamMemberFormDialog.tsx": "Dialog form for creating or editing a team member with validation and mutation handling.",
  "frontend/src/components/TeamMembersTab.tsx": "Lists team members with search, filters, and CRUD actions depending on user permissions.",
  "frontend/src/components/UserProfilesTab.tsx": "Admin-only interface to view and update user roles with loading and access handling.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor based on Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useCalendarReminders.ts": "Periodically checks upcoming programs, agenda items, and KPIs to show 24‑hour and 3‑hour toast reminders with deduping.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, loading stored identities, handling login/logout, and exposing identity context.",
  "frontend/src/hooks/useMediaQuery.ts": "Returns whether a given CSS media query matches, updating reactively on changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, admin actions, and program queries including date‑range filtering.",
  "frontend/src/index.css": "Tailwind CSS base and utility layers defining theme variables, dark mode, gradients, animations, and component styling.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, Internet Identity provider, and loading the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page with tabbed navigation showing program, KPI, calendar, team, reports, and admin user sections based on caller admin status.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity to authenticate users, displaying a card with a login button and loading state.",
  "frontend/src/utils/reminderDedup.ts": "Utility for deduplicating reminder notifications using timestamped localStorage records with automatic expiry cleanup.",
  "frontend/src/utils/safeBrowserStorage.ts": "Safe wrappers around localStorage for JSON, strings, and removal with error handling and SSR fallback.",
  "frontend/src/utils/urlParams.ts": "URL and session-storage utilities for reading, persisting, and clearing parameters from query strings and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended colors, radius, shadows, animations, and typography/container-query plugins.",
  "project_state.json": "Describes the current project state for a redesigned Program Calendar UI, including goals, architectural notes, known issues, and existing features."
}