{
  "kind": "build_request",
  "title": "Fix Team member photo add/change click responsiveness in form and cards, with instant refresh in Structure View",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-65",
      "text": "Fix the Team Member Card photo change interaction so clicking/tapping the avatar frame reliably opens the device file picker (mobile + desktop) when the user has edit permission, and never appears unresponsive due to overlay elements intercepting pointer events.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Icon menambah foto belum berfungsi..",
          "Keduanya. Iya. Ketika diklik tidak berfungsi"
        ]
      },
      "acceptanceCriteria": [
        "On the Team tab (Cards view), clicking/tapping a team member’s avatar frame opens the OS file chooser when editing is allowed.",
        "The click works even when the hover upload overlay is visible (overlay must not block the click).",
        "While an upload is in progress, the avatar click is disabled and does not trigger multiple file-chooser opens or parallel uploads.",
        "All user-facing text shown during this flow (errors, toasts, tooltips) is English."
      ]
    },
    {
      "id": "REQ-66",
      "text": "Fix the Team Member create/edit dialog photo upload control so clicking the “Choose from Device” button reliably opens the device file picker (mobile + desktop) and does not silently fail due to ref/disabled-state issues.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Keduanya. Iya. Ketika diklik tidak berfungsi"
        ]
      },
      "acceptanceCriteria": [
        "In the Team Member create/edit dialog, clicking “Choose from Device” always opens the OS file chooser when not uploading.",
        "If the file input is disabled (e.g., during upload), the UI makes it clear via the existing disabled state and does not appear clickable.",
        "After selecting a file, upload progress and success/failure states continue to behave as currently designed (progress bar, toasts, preview, submit blocked during upload).",
        "All user-facing strings related to this flow remain in English."
      ]
    },
    {
      "id": "REQ-67",
      "text": "Ensure that after a successful photo upload/update from the Team Member Card or the Team Member form, the updated avatar URL is immediately reflected across the Team UI, including the Structure View, without requiring a page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Di bagian card dan automatis juga diterapkan pada struktur"
        ]
      },
      "acceptanceCriteria": [
        "After updating a member photo in Cards view, switching to Structure View shows the updated avatar for that member without a hard refresh.",
        "After updating a member photo in the edit dialog, both Cards view and Structure View show the updated avatar after the dialog closes.",
        "No crashes occur if the uploaded URL is missing/invalid; the UI falls back to initials gracefully."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify any files under frontend/src/components/ui.",
    "Do not change Internet Identity hooks or actor creation logic (immutable paths in frontend/src/hooks/* and frontend/src/main.tsx).",
    "Do not change the Team backend data model or APIs as part of this fix; this is a frontend interaction/refresh issue."
  ],
  "nonGoals": [
    "Changing or replacing the external image hosting providers beyond what is required to fix the click-to-open file chooser issue.",
    "Adding new backend endpoints or storing image blobs on the backend.",
    "Redesigning the Team UI beyond what is necessary to make the existing photo controls responsive and reliable."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for all user-facing UI text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}