{
  "kind": "build_request",
  "title": "Remove manual photo URL option from Team Member create/edit (file-upload only)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-53",
      "text": "Update the Team Member create/edit dialog (frontend/src/components/TeamMemberFormDialog.tsx) to remove the manual photo URL input option so photos can only be added via device file upload, while still storing only the hosted image URL in the existing `avatar` field for both create and edit flows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Hapus pilihan URL photo",
          "Iya. Iya. Iya berlaku.\n\nKerjakan sekarang"
        ]
      },
      "acceptanceCriteria": [
        "The 'Or enter photo URL manually' label and the avatar URL <Input> field are removed from the Team Member form UI.",
        "Users can only add/update a photo by selecting an image file from their device (the existing file picker + upload flow remains).",
        "Create flow: after successful upload, the resulting hosted URL is stored into `avatar` and submitted to the backend when the form is saved.",
        "Edit flow: existing `member.avatar` (if present) is shown via the preview; user can replace it by uploading a new file or clear it using the existing clear action.",
        "No URL validation is performed during submit (do not block submission based on `isValidUrl`), since manual URL entry is no longer possible.",
        "All user-facing text introduced/modified by this change remains in English."
      ]
    },
    {
      "id": "REQ-54",
      "text": "Remove now-unused manual-URL related logic from the Team Member form implementation, while keeping image upload error handling, upload progress UI, and preview behavior intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Hapus pilihan URL photo"
        ]
      },
      "acceptanceCriteria": [
        "Any dead code paths tied to manual URL entry (e.g., `handleAvatarChange`, avatar URL validation errors meant for manual entry, and any now-unused imports such as `isValidUrl` if no longer needed) are removed.",
        "The preview component (frontend/src/components/team/PhotoUrlPreview.tsx) is still used to preview the currently stored/uploaded `avatar` URL and shows appropriate error state if the hosted image fails to load.",
        "The upload button remains disabled during upload; submit remains disabled during upload (no regressions to the existing protections).",
        "Successful upload still shows an English success toast; failures still show an English error toast and inline error text."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not change backend schema/APIs for this request; the backend continues to store only the hosted image URL in the existing TeamMember.avatar field."
  ],
  "nonGoals": [
    "Do not add image cropping or any additional photo editing features.",
    "Do not add alternative photo sources (camera capture, third-party providers, or URL-based input).",
    "Do not change the external image hosting provider or upload endpoint behavior beyond what is necessary to support file-upload-only UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}