{
  "kind": "build_request",
  "title": "Apply SHQ dark navy theme and reposition top navigation across the full layout",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-72",
      "text": "Apply a global SHQ theme across the entire app (all pages/tabs) using a dark navy base with light green accents, using IMG_0109.jpeg as a visual style reference only (do not set it as the literal background image). Update the global Tailwind/CSS theme tokens so that backgrounds, cards, borders, and focus rings consistently reflect the new palette while maintaining readable contrast in both light and dark modes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Seluruh layout. ... Biru tua + aksen hijau muda. ... Sesuaikan saja, dengan tampilan yang sudah ada sekarang.",
          "Build sekarang"
        ]
      },
      "acceptanceCriteria": [
        "The app uses a dark navy base with light green accents consistently on Dashboard, Calendar, Program, KPI, Team, Reports, Login, and Profile Setup screens.",
        "The uploaded IMG_0109.jpeg is not used as a literal background image anywhere in the app.",
        "Primary/active/selected states (e.g., selected tab, primary buttons, focus rings) use the light green accent or compatible SHQ accent styling; contrast remains accessible (text remains readable on backgrounds/cards).",
        "No regressions in component styling that make UI elements illegible in either light mode or dark mode."
      ]
    },
    {
      "id": "REQ-73",
      "text": "Update the top navigation/menu placement to match the uploaded reference layout style: render the main tab menu as a centered, rounded, translucent 'pill' navigation bar near the top (aligned with the header area), with clear active state and spacing similar to IMG_0109.jpeg, while keeping the existing set of tabs, permissions (admin-only Users tab), and navigation behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Posisi menu..",
          "Ubah tampilan background dan penempatan fitur seperti ini",
          "Biru tua + aksen hijau muda. Sesuaikan saja, dengan tampilan yang sudah ada sekarang."
        ]
      },
      "acceptanceCriteria": [
        "The tab menu (Dashboard/Calendar/Program/KPI/Team/Reports/(Users for admin)) is visually centered in a rounded translucent container at the top, matching the reference style direction.",
        "Active tab state is clearly visible and uses the new SHQ accent styling.",
        "Tab navigation continues to work exactly as before (same tabs, same content rendering, admin tab still conditional).",
        "Navigation layout is responsive: on small screens the menu remains usable without overflowing the viewport (e.g., wraps, scrolls, or compresses appropriately without breaking clicks)."
      ]
    },
    {
      "id": "REQ-74",
      "text": "Refine the header + page background treatment to align with the SHQ look: use a subtle dark navy gradient/texture-like feel (CSS-based, not the uploaded image) and harmonize Header, main container, and Footer backgrounds so the layout feels like one cohesive system while keeping existing content and functionality unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Tidak, itu hanya contoh. Biru tua + aksen hijau muda. Sesuaikan saja, dengan tampilan yang sudah ada sekarang."
        ]
      },
      "acceptanceCriteria": [
        "Header, main content background, and footer visually match the SHQ dark navy theme and look cohesive (no clashing gradients/colors).",
        "The background treatment is implemented via CSS (gradients/noise-like styling) and does not rely on IMG_0109.jpeg as a background asset.",
        "Existing header actions remain functional (theme toggle, user menu, logout).",
        "No content overlaps or z-index issues: the header and centered menu remain clickable and do not cover important page content."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not use IMG_0109.jpeg as the literal background image; it is reference-only.",
    "Do not change backend APIs, data models, or persistence for this request."
  ],
  "nonGoals": [
    "Adding new dashboard tabs or changing existing tab names/permissions.",
    "Implementing new backend features or modifying calendar/program/team/KPI logic beyond visual/layout changes.",
    "Introducing third-party UI frameworks beyond the existing stack."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}