{
  "kind": "build_request",
  "title": "Fix Program Calendar tab rendering blank (no UI visible)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-33",
      "text": "Fix the Program Calendar dashboard tab so it always renders visible UI (header, filters, view controls, and a calendar body) when the user clicks the Calendar tab, instead of showing a completely blank/empty screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Tampilan tidak muncul sama sekali... tidak muncul apa-apa",
          "Kosong total tidak ada apa-apa. Tidak ada tampilan... hanya fitur kalender yang tidak muncul apa-apa ketika diklik."
        ]
      },
      "acceptanceCriteria": [
        "Clicking the Calendar tab shows the Program Calendar header and controls immediately (even while data is loading).",
        "The Calendar tab never results in a totally blank screen; if something fails, an in-UI error state is displayed instead.",
        "The behavior is consistent across Month/Week/Day/Agenda modes on both desktop and mobile."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Add defensive runtime guards in ProgramCalendarTab (frontend/src/components/ProgramCalendarTab.tsx) so browser-API usage cannot crash rendering, including safe handling for localStorage reads/writes (e.g., blocked storage) and Notification permission requests.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Tampilan tidak muncul sama sekali. Sepertinya perilaku UI yang tidak sesuai."
        ]
      },
      "acceptanceCriteria": [
        "If localStorage is unavailable or throws, the calendar still renders and reminders default to enabled (or a safe default) without crashing.",
        "Toggling reminders does not throw even when Notifications are unsupported/blocked; the UI remains usable.",
        "No uncaught exceptions occur from localStorage/Notification access when opening the Calendar tab."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Ensure ProgramCalendarTab gracefully handles data-shape edge cases so calendar rendering cannot crash when program fields are unexpected (e.g., missing/undefined nested fields) by adding safe access patterns and fallback display values where needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Kosong total tidak ada apa-apa. Tidak ada tampilan."
        ]
      },
      "acceptanceCriteria": [
        "If any program item is missing a nested field (e.g., personInCharge), the Calendar tab still renders and the item is either shown with fallbacks (e.g., 'Unknown') or skipped without crashing.",
        "Filters (PIC, Division, Status, Priority) do not throw when program data is incomplete.",
        "No uncaught exceptions occur during render when programs/agenda/KPI arrays contain malformed entries."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Add a user-visible, English error/empty-state UI within the Calendar tab when data queries fail or return no items, including a clear 'Retry' action that triggers React Query refetch for the calendar range queries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Saat ini tidak berfungsi",
          "Tampilan tidak muncul sama sekali."
        ]
      },
      "acceptanceCriteria": [
        "If a calendar query fails, the calendar shows an English error message (not a blank area) and a Retry button.",
        "Retry refetches the relevant calendar queries and updates the UI accordingly.",
        "If there are no programs/agenda items/KPI deadlines in range, the calendar shows an English empty state explaining there is nothing scheduled in the visible range."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose instead of modifying).",
    "Keep the backend as a single Motoko actor in backend/main.mo; only add backend changes if strictly required to fix the calendar rendering issue.",
    "Use English for any new/updated user-facing text introduced as part of these fixes."
  ],
  "nonGoals": [
    "Do not redesign the overall calendar UI/UX beyond what is necessary to stop it rendering blank.",
    "Do not add new calendar features (new filters, new modes, new entities) as part of this fix.",
    "Do not change authentication behavior or Internet Identity integration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}