{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Program Calendar full-width redesign with view switcher, filters, badges, detail panels, and range-based loading",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Redesign ProgramCalendarTab into a full-width, readability-first calendar layout for desktop and mobile.",
      "acceptanceCriteria": [
        "On desktop, the calendar UI is the dominant element on the screen (no small sidebar calendar layout).",
        "Typography and spacing are noticeably larger/more spacious than the current calendar tab, improving readability.",
        "Calendar grid layout is visually consistent and aligned (no cramped cells, clear day boundaries).",
        "The calendar tab remains accessible and usable on mobile without horizontal scrolling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProgramCalendarTab.tsx",
          "operation": "modify",
          "description": "Replace the current sidebar Calendar + table layout with a full-width calendar experience (responsive header, main calendar area, and contextual side/drawer panels). Compose existing shadcn/ui components (read-only) to deliver larger typography, generous spacing, and a clean grid on desktop and a mobile-friendly layout without horizontal scrolling."
        },
        {
          "path": "frontend/src/components/program-calendar/ProgramCalendarLayout.tsx",
          "operation": "create",
          "description": "Create a focused layout component for the Program Calendar tab that owns the page structure (header area, filters row, view switcher row, main view container, and panel/drawer host) to ensure consistent spacing and full-width behavior across breakpoints."
        },
        {
          "path": "frontend/src/components/program-calendar/calendarStyles.ts",
          "operation": "create",
          "description": "Add shared style helpers (className maps for grid density, typography scale, and responsive spacing) used across calendar subcomponents to keep the grid aligned and readable."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add Monthly/Weekly/Agenda view switching with desktop default Monthly and mobile default Agenda, preserving selected date/range on switch.",
      "acceptanceCriteria": [
        "Users can switch between Monthly, Weekly, and Agenda views via a clearly visible control above the calendar.",
        "Monthly and Weekly modes render as a calendar grid on desktop.",
        "On small screens, Agenda view presents a vertical agenda list (Google Calendar-like) that is readable and not cramped.",
        "Switching modes preserves the currently selected date (or visible range) and updates the displayed content accordingly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/program-calendar/ProgramCalendarViewSwitcher.tsx",
          "operation": "create",
          "description": "Implement a view mode switcher control (Monthly/Weekly/Agenda) designed to sit above the calendar, using composed shadcn/ui controls (read-only). Ensure it supports controlled state and reflects current mode."
        },
        {
          "path": "frontend/src/components/program-calendar/ProgramCalendarResponsiveDefaults.ts",
          "operation": "create",
          "description": "Add a small utility to choose the initial view mode based on screen size (Monthly default on desktop, Agenda default on mobile) while preserving user switches during the session."
        },
        {
          "path": "frontend/src/components/ProgramCalendarTab.tsx",
          "operation": "modify",
          "description": "Introduce view mode state, selected date state, and visible range state; wire the new ProgramCalendarViewSwitcher above the calendar and route rendering to Monthly/Weekly/Agenda subviews while preserving selected date / visible range when switching."
        },
        {
          "path": "frontend/src/components/program-calendar/views/MonthGridView.tsx",
          "operation": "create",
          "description": "Create the Monthly grid view renderer (desktop-first grid) that can render day cells consistently and interact with selected date / day click behavior."
        },
        {
          "path": "frontend/src/components/program-calendar/views/WeekGridView.tsx",
          "operation": "create",
          "description": "Create the Weekly grid view renderer (desktop-first grid) that can render day cells consistently and interact with selected date / day click behavior."
        },
        {
          "path": "frontend/src/components/program-calendar/views/AgendaListView.tsx",
          "operation": "create",
          "description": "Create the Agenda view renderer as a vertical list suitable for mobile readability, driven by the same filtered program set and selected/visible range."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add Unit/Division, PIC, Status, and Priority filters above the calendar with reset; apply consistently across all views and detail panels.",
      "acceptanceCriteria": [
        "Filter controls are placed above the calendar and remain visible/accessible in all view modes.",
        "Selecting filters updates the visible programs and counts without requiring a page refresh.",
        "A clear/reset action exists to return filters to the unfiltered state.",
        "Filtering works consistently for the selected day’s program list and for agenda lists."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/program-calendar/ProgramCalendarFilters.tsx",
          "operation": "create",
          "description": "Implement filter controls (Unit/Division, PIC, Status, Priority) designed for placement directly above the calendar, composing existing shadcn/ui inputs/selects (read-only). Include a clear/reset action and expose controlled filter state to the parent."
        },
        {
          "path": "frontend/src/components/program-calendar/programFilterUtils.ts",
          "operation": "create",
          "description": "Add pure utilities to apply the selected filters to a Program list (and to compute derived values like counts per day) so Monthly/Weekly/Agenda views and detail panels can share identical filtering behavior."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks to fetch filter option sources needed by the calendar filters (e.g., unique divisions, unique PIC names, unique priorities) using existing backend capabilities, with stable caching keys."
        },
        {
          "path": "frontend/src/components/ProgramCalendarTab.tsx",
          "operation": "modify",
          "description": "Wire ProgramCalendarFilters above the calendar, store filter state at the tab level, and ensure all view renderers and detail panels receive and use the same filtered dataset and reset behavior."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Show per-day badge counts in Monthly/Weekly grids and open a day detail panel (desktop side panel; mobile modal/sheet) listing programs for that date.",
      "acceptanceCriteria": [
        "Each day cell in Monthly/Weekly views can show a numeric badge count when programs exist for that date (respecting filters).",
        "Clicking a day opens a detail UI (right-side panel on desktop; modal/sheet on mobile) that lists programs active on that date.",
        "The day detail UI clearly indicates the chosen date and supports closing/dismissing.",
        "If no programs match for a date, the UI communicates this state clearly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/program-calendar/DayCell.tsx",
          "operation": "create",
          "description": "Create a reusable day cell component for Month/Week grids that renders the date label and a numeric badge count (derived from the filtered program set). Support click/keyboard interaction to open day details."
        },
        {
          "path": "frontend/src/components/program-calendar/DayDetailPanel.tsx",
          "operation": "create",
          "description": "Implement the day detail UI that lists programs active on the chosen date, with a clear date header, empty state, and a close action. Render as a right-side panel on desktop and as a modal/sheet on smaller screens using composed shadcn/ui primitives (read-only)."
        },
        {
          "path": "frontend/src/components/program-calendar/views/MonthGridView.tsx",
          "operation": "modify",
          "description": "Use DayCell to render the month grid with aligned day boundaries and badge counts, and wire day clicks to open the DayDetailPanel."
        },
        {
          "path": "frontend/src/components/program-calendar/views/WeekGridView.tsx",
          "operation": "modify",
          "description": "Use DayCell to render the week grid with aligned day boundaries and badge counts, and wire day clicks to open the DayDetailPanel."
        },
        {
          "path": "frontend/src/components/ProgramCalendarTab.tsx",
          "operation": "modify",
          "description": "Add state for the active day detail (open/close + selected day) and ensure day clicks from Month/Week views open the correct detail UI variant based on breakpoint."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Open a program detail drawer/sheet from any list with required fields and an Edit button that reuses ProgramFormDialog, refreshing calendar data after edits.",
      "acceptanceCriteria": [
        "Program detail drawer/sheet includes: description, period dates, PIC, progress bar visualization, status, and an Edit button.",
        "Edit button opens the existing program edit dialog and successfully saves updates.",
        "After editing, the calendar/day/agenda views refresh to reflect changes (including badges/counts and lists).",
        "The drawer/sheet is usable on both desktop and mobile (scrollable if content overflows)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx",
          "operation": "create",
          "description": "Create a program detail drawer/sheet component that displays description, period (start/end), PIC, progress bar, status, and an Edit button. Compose existing shadcn/ui components (read-only) and ensure responsive/scrollable behavior on mobile."
        },
        {
          "path": "frontend/src/components/ProgramCalendarTab.tsx",
          "operation": "modify",
          "description": "Wire program click handlers from Month/Week day panels and Agenda lists to open ProgramDetailDrawer; integrate the existing ProgramFormDialog edit flow from the drawer's Edit button; ensure close/open state is managed and that updates are reflected after save."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update program mutation invalidation to also refresh any new range-based calendar queries introduced for Monthly/Weekly/Agenda so that counts/badges and lists update after edits."
        },
        {
          "path": "frontend/src/components/program-calendar/views/AgendaListView.tsx",
          "operation": "modify",
          "description": "Ensure agenda items are clickable and open ProgramDetailDrawer with the selected program."
        },
        {
          "path": "frontend/src/components/program-calendar/DayDetailPanel.tsx",
          "operation": "modify",
          "description": "Ensure program rows/items in the day detail list are clickable and open ProgramDetailDrawer with the selected program."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Load programs by visible Monthly/Weekly ranges via React Query using getProgramsActiveInRange, with correct JS Date to BigInt ms conversion and stable caching to avoid excessive refetches.",
      "acceptanceCriteria": [
        "Monthly and Weekly views fetch programs for the currently visible date range (not just a single selected day).",
        "Date range conversion to BigInt milliseconds is correct and consistent with existing useGetProgramsActiveOnDate behavior.",
        "React Query caching keys differentiate by range so navigation between months/weeks behaves predictably (no stale data displayed).",
        "No backend schema changes are required to support the new calendar views."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/timeRange.ts",
          "operation": "create",
          "description": "Add shared utilities for converting JavaScript Date ranges into backend-compatible TimeRange (BigInt milliseconds), including helpers for start/end-of-day and for normalizing visible month/week ranges."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook for fetching programs active in an arbitrary visible range (Month/Week/Agenda), using caching keys that include normalized range boundaries (start/end) to prevent stale displays and avoid excessive refetches when navigating."
        },
        {
          "path": "frontend/src/components/ProgramCalendarTab.tsx",
          "operation": "modify",
          "description": "Replace single-day loading as the primary data source with range-based loading for Monthly/Weekly/Agenda views; compute visible ranges on navigation (month/week changes) and pass those ranges into the range query hook while keeping selected date stable."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Refine Program Calendar visual design with modern card-based UI, soft shadows, consistent icons, and muted readable status/priority colors while keeping a full-width layout.",
      "acceptanceCriteria": [
        "Status/priority colors are readable and not overly saturated; contrast meets readability expectations in both light/dark modes.",
        "Cards/panels use consistent spacing, radius, and soft shadow styling aligned with the rest of the dashboard.",
        "Icons used in the calendar area are consistent in size and style.",
        "Calendar layout remains full-width and visually balanced on desktop and mobile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/program-calendar/statusPriorityStyles.ts",
          "operation": "create",
          "description": "Define a consistent, non-garish mapping for Program status/priority to badge/pill styles (className tokens) that work in light/dark modes and can be reused across grid cells, lists, and drawers."
        },
        {
          "path": "frontend/src/components/program-calendar/ProgramDetailDrawer.tsx",
          "operation": "modify",
          "description": "Apply the refined card/panel styling (soft shadow, consistent spacing/radius) and consistent icon sizing to the program detail drawer/sheet using composed shadcn/ui components (read-only)."
        },
        {
          "path": "frontend/src/components/program-calendar/DayDetailPanel.tsx",
          "operation": "modify",
          "description": "Apply refined card/panel styling and consistent iconography to the day detail UI, ensuring readability and visual consistency with the dashboard."
        },
        {
          "path": "frontend/src/components/ProgramCalendarTab.tsx",
          "operation": "modify",
          "description": "Ensure the calendar tab presentation remains full-width (no cramped sidebar), uses modern card-based sections, and standardizes icon usage within the calendar header/actions and list items."
        }
      ]
    }
  ]
}