{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "SHQ dark navy theming + centered pill top navigation",
  "requirements": [
    {
      "id": "REQ-72",
      "summary": "Apply a global SHQ dark navy + light green accent theme via Tailwind/CSS tokens across all screens, ensuring accessible contrast in light and dark modes and keeping IMG_0109.jpeg as reference-only.",
      "acceptanceCriteria": [
        "The app uses a dark navy base with light green accents consistently on Dashboard, Calendar, Program, KPI, Team, Reports, Login, and Profile Setup screens.",
        "The uploaded IMG_0109.jpeg is not used as a literal background image anywhere in the app.",
        "Primary/active/selected states (e.g., selected tab, primary buttons, focus rings) use the light green accent or compatible SHQ accent styling; contrast remains accessible (text remains readable on backgrounds/cards).",
        "No regressions in component styling that make UI elements illegible in either light mode or dark mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global CSS variables (background/card/border/ring/primary/secondary/accent) to a SHQ dark navy base with light green accents for both :root and .dark; ensure focus ring tokens and chart/category variables remain readable. Do not reference or apply IMG_0109.jpeg as a background image."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Ensure Tailwind theme continues to map semantic color tokens (background/card/border/ring/primary/accent/etc.) to the updated CSS variables so all shadcn-ui styling picks up the new SHQ palette. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Adjust Login screen container/background and card styling to match the updated SHQ theme tokens (navy base + green accent) without changing login behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Confirm Profile Setup modal (Dialog, inputs, select, button) visually aligns with new SHQ theme tokens (card/background/border/ring/accent) while preserving functionality and readability. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "If this stylesheet is used by the build, align/bridge its theme variables with the SHQ navy + green palette to avoid inconsistent styling between entry stylesheets; do not apply IMG_0109.jpeg as a background image."
        }
      ]
    },
    {
      "id": "REQ-73",
      "summary": "Reposition the main tab menu into a centered rounded translucent pill near the top, preserving existing tabs, admin-only Users tab gating, and navigation behavior with responsive overflow handling.",
      "acceptanceCriteria": [
        "The tab menu (Dashboard/Calendar/Program/KPI/Team/Reports/(Users for admin)) is visually centered in a rounded translucent container at the top, matching the reference style direction.",
        "Active tab state is clearly visible and uses the new SHQ accent styling.",
        "Tab navigation continues to work exactly as before (same tabs, same content rendering, admin tab still conditional).",
        "Navigation layout is responsive: on small screens the menu remains usable without overflowing the viewport (e.g., wraps, scrolls, or compresses appropriately without breaking clicks)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TopPillNav.tsx",
          "operation": "create",
          "description": "Create a reusable TopPillNav component that renders the existing TabsList/TabsTrigger set in a centered, rounded, translucent pill container; support admin-only Users tab visibility and a clear active state using SHQ accent tokens. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Wire TopPillNav into the Dashboard layout: move the TabsList out of the main content area into a top-aligned, centered placement (near the Header), keeping the same Tabs value/onValueChange behavior and the admin-only Users tab condition. Add responsive handling (e.g., horizontal scroll on small screens) to prevent overflow while keeping clicks functional. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust utility classes (or refine existing ones) to support the pill nav look: translucent background, subtle border, backdrop blur, and SHQ-accent active state styling for tab triggers without relying on IMG_0109.jpeg."
        }
      ]
    },
    {
      "id": "REQ-74",
      "summary": "Refine header + page background styling with a cohesive SHQ dark navy CSS-based gradient/texture feel across Header, main container, and Footer without affecting existing functionality or causing layering/click issues.",
      "acceptanceCriteria": [
        "Header, main content background, and footer visually match the SHQ dark navy theme and look cohesive (no clashing gradients/colors).",
        "The background treatment is implemented via CSS (gradients/noise-like styling) and does not rely on IMG_0109.jpeg as a background asset.",
        "Existing header actions remain functional (theme toggle, user menu, logout).",
        "No content overlaps or z-index issues: the header and centered menu remain clickable and do not cover important page content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Implement SHQ-style background treatment via CSS (subtle dark navy gradients and optional texture-like effect) and define shared utility classes to keep Header/Main/Footer visually cohesive; ensure layering utilities support sticky header + centered pill nav without click-through issues."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update Header background/border/backdrop styling to harmonize with the SHQ navy gradient system and ensure correct z-index/sticky behavior alongside the centered pill navigation; keep theme toggle, user menu, and logout behavior unchanged. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Adjust Footer background and border styling to match the SHQ cohesive layout (navy base, subtle borders) while keeping existing content unchanged. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Align the Dashboard main container background usage with the updated SHQ gradient/texture utilities so Header + centered pill nav + content + Footer feel like one system; verify no overlap or z-index issues with sticky elements. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the authenticated and unauthenticated roots use the same cohesive SHQ background treatment (via theme tokens/utilities) so transitions between Login/Profile Setup/Dashboard feel consistent, without changing auth or gating logic. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}