{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Team photo picker click reliability and instant avatar refresh across Cards + Structure View",
  "requirements": [
    {
      "id": "REQ-65",
      "summary": "Make Team Member Card avatar frame reliably open the device file picker when editable, without overlay elements intercepting pointer events, and prevent multiple opens during upload.",
      "acceptanceCriteria": [
        "On the Team tab (Cards view), clicking/tapping a team member’s avatar frame opens the OS file chooser when editing is allowed.",
        "The click works even when the hover upload overlay is visible (overlay must not block the click).",
        "While an upload is in progress, the avatar click is disabled and does not trigger multiple file-chooser opens or parallel uploads.",
        "All user-facing text shown during this flow (errors, toasts, tooltips) is English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/team/TeamMemberCard.tsx",
          "operation": "modify",
          "description": "Refactor the card avatar upload interaction to be mobile/desktop reliable: ensure the hover overlay does not intercept pointer events (e.g., pointer-events handling), make the clickable target be the avatar frame consistently (not dependent on hover), and add a lightweight guard to prevent repeated file-input clicks while a chooser is already being opened. Keep the existing disabled behavior during isUploading and keep all user-facing strings in English."
        }
      ]
    },
    {
      "id": "REQ-66",
      "summary": "Make the Team Member create/edit dialog “Choose from Device” control reliably open the device file picker, with clear disabled behavior during upload.",
      "acceptanceCriteria": [
        "In the Team Member create/edit dialog, clicking “Choose from Device” always opens the OS file chooser when not uploading.",
        "If the file input is disabled (e.g., during upload), the UI makes it clear via the existing disabled state and does not appear clickable.",
        "After selecting a file, upload progress and success/failure states continue to behave as currently designed (progress bar, toasts, preview, submit blocked during upload).",
        "All user-facing strings related to this flow remain in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TeamMemberFormDialog.tsx",
          "operation": "modify",
          "description": "Harden the dialog file-picker trigger so it cannot silently fail due to ref timing/disabled-state: only trigger the hidden input when not uploading, ensure the trigger is not perceived as clickable when disabled, and add a small anti-double-click guard similar to the card flow. Preserve existing progress/toast/preview/submit-blocking behavior and keep all user-facing strings in English."
        }
      ]
    },
    {
      "id": "REQ-67",
      "summary": "After successful photo upload/update from Card or Dialog, immediately reflect the new avatar across Cards and Structure View without reload, with safe fallback when URL is missing/invalid.",
      "acceptanceCriteria": [
        "After updating a member photo in Cards view, switching to Structure View shows the updated avatar for that member without a hard refresh.",
        "After updating a member photo in the edit dialog, both Cards view and Structure View show the updated avatar after the dialog closes.",
        "No crashes occur if the uploaded URL is missing/invalid; the UI falls back to initials gracefully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/team/TeamMemberCard.tsx",
          "operation": "modify",
          "description": "After a successful avatar update, immediately update the in-memory team member list used by the Team UI (React Query cache for the existing team members query) so Cards and Structure View reflect the new avatar instantly without waiting for a refetch. Ensure fallback behavior remains safe if the URL is missing/invalid."
        },
        {
          "path": "frontend/src/components/TeamMemberFormDialog.tsx",
          "operation": "modify",
          "description": "After a successful avatar upload (and subsequent member save), update the cached team member list so the updated avatar is visible immediately after the dialog closes in both Cards and Structure View."
        },
        {
          "path": "frontend/src/components/team/TeamStructureNode.tsx",
          "operation": "modify",
          "description": "Add the same defensive avatar URL validation/fallback behavior used elsewhere (avoid broken/invalid URL usage) so Structure View never crashes and falls back to initials gracefully when avatar is missing/invalid."
        }
      ]
    }
  ]
}