{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix KPI Form Invalid Record Error on Save",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the 'invalid record' error when saving KPI form by ensuring frontend data structure matches backend KPI type definition exactly",
      "acceptanceCriteria": [
        "KPI form successfully saves without 'invalid record' error when all required fields are filled",
        "Form validates data types correctly before submission (Nilai Target and Nilai Realisasi as numbers)",
        "Dropdown values (Program Terkait, Tim/PIC, Periode, Status) serialize correctly to backend format",
        "Error messages are specific and indicate which field is invalid if validation fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/KpiFormDialog.tsx",
          "operation": "modify",
          "description": "Fix the KPI form data serialization to match the backend Kpi interface exactly. Ensure targetValue and realizationValue are converted to BigInt (not strings), relatedProgramId is sent as bigint (not string or program name), and team field contains a PersonInCharge object with id (bigint), name, role, and division fields. Add comprehensive field-level validation before submission and improve error handling to display specific field errors from backend responses. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the createKpi and updateKpi mutation functions to include detailed error logging that captures and parses backend validation errors. Add console logging for the request payload structure and backend response errors. Ensure error messages are extracted and passed to the toast notifications with specific field information when available. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure Nilai Target (target value) field in KPI form is properly typed and serialized as a number (Nat) when submitting to backend",
      "acceptanceCriteria": [
        "Nilai Target input field parses numeric input correctly",
        "Form submission sends Nilai Target as number type to backend",
        "Validation rejects non-numeric input in Nilai Target field"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/KpiFormDialog.tsx",
          "operation": "modify",
          "description": "Add explicit type conversion for the Nilai Target (targetValue) field to parse the string input as an integer and convert to BigInt before submission. Add input validation to ensure only numeric values are accepted and show validation errors for non-numeric input. Update the form state to handle numeric types correctly throughout the form lifecycle."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure Nilai Realisasi (realization value) field in KPI form is properly typed and serialized as a number (Nat) when submitting to backend",
      "acceptanceCriteria": [
        "Nilai Realisasi input field parses numeric input correctly",
        "Form submission sends Nilai Realisasi as number type to backend",
        "Validation rejects non-numeric input in Nilai Realisasi field"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/KpiFormDialog.tsx",
          "operation": "modify",
          "description": "Add explicit type conversion for the Nilai Realisasi (realizationValue) field to parse the string input as an integer and convert to BigInt before submission. Add input validation to ensure only numeric values are accepted and show validation errors for non-numeric input. Update the form state to handle numeric types correctly throughout the form lifecycle."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Verify Program Terkait (Related Program) dropdown correctly maps the selected program to the backend-expected format (program ID)",
      "acceptanceCriteria": [
        "Program Terkait selection sends correct program identifier to backend",
        "Dropdown loads available programs from backend",
        "Selected program value matches backend KPI.relatedProgramId field type"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/KpiFormDialog.tsx",
          "operation": "modify",
          "description": "Ensure the Program Terkait dropdown stores and submits the program ID as a BigInt (not the program name or string ID). Update the form state to track the selected program by its numeric ID. Verify that the RelatedProgramCombobox component passes the program ID correctly and update the form submission logic to convert the program ID to BigInt for the relatedProgramId field."
        },
        {
          "path": "frontend/src/components/RelatedProgramCombobox.tsx",
          "operation": "modify",
          "description": "Review and ensure the combobox returns the program ID (bigint) when a program is selected, not the program name or other field. Update the value prop handling to work with numeric IDs and ensure the parent form receives the correct ID type for submission."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Verify Tim/PIC (Team/Person in Charge) dropdown correctly maps the selected team member to the backend-expected PersonInCharge format",
      "acceptanceCriteria": [
        "Tim/PIC selection sends correct team member identifier to backend",
        "Dropdown loads available team members from backend",
        "Selected team member value matches backend KPI.team field type (PersonInCharge)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/KpiFormDialog.tsx",
          "operation": "modify",
          "description": "Ensure the Tim/PIC dropdown creates a complete PersonInCharge object for the team field containing id (bigint), name (string), role (string), and division (string). The form should not submit just the team member ID or name string; it must construct the full PersonInCharge object structure matching the backend type. Update form state and submission logic to build this object from the selected team member data."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add comprehensive error logging in KPI form submission to capture and display specific field validation errors from the backend response",
      "acceptanceCriteria": [
        "Error messages from backend are caught and displayed to user",
        "Console logs show detailed error information including field name and validation failure reason",
        "Toast notifications display user-friendly error messages in Indonesian"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Enhance error handling in the createKpi and updateKpi mutations to parse backend error responses and extract field-specific validation errors. Add detailed console.error logging that includes the full error object, request payload, and any error details from the backend. Update toast notifications to show specific field errors in Indonesian when available, falling back to generic error messages when field details are not present."
        },
        {
          "path": "frontend/src/components/KpiFormDialog.tsx",
          "operation": "modify",
          "description": "Add client-side pre-submission validation logging that outputs the complete form data structure to the console before sending to the backend. Add try-catch blocks around the mutation calls to capture and log any errors during submission. Display field-specific error messages in the form UI when validation fails, highlighting the problematic fields for the user."
        }
      ]
    }
  ]
}