{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove manual photo URL entry from Team Member form (file-upload only)",
  "requirements": [
    {
      "id": "REQ-53",
      "summary": "Update TeamMemberFormDialog UI to remove manual avatar URL entry and enforce device file upload as the only way to add/update photos while still storing hosted URL in `avatar` for create/edit.",
      "acceptanceCriteria": [
        "The 'Or enter photo URL manually' label and the avatar URL <Input> field are removed from the Team Member form UI.",
        "Users can only add/update a photo by selecting an image file from their device (the existing file picker + upload flow remains).",
        "Create flow: after successful upload, the resulting hosted URL is stored into `avatar` and submitted to the backend when the form is saved.",
        "Edit flow: existing `member.avatar` (if present) is shown via the preview; user can replace it by uploading a new file or clear it using the existing clear action.",
        "No URL validation is performed during submit (do not block submission based on `isValidUrl`), since manual URL entry is no longer possible.",
        "All user-facing text introduced/modified by this change remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TeamMemberFormDialog.tsx",
          "operation": "modify",
          "description": "Remove the manual avatar URL entry section (label + input) from the Photo area, leaving only the existing file picker/upload flow and clear action; keep storing the hosted URL into formData.avatar after upload and submitting it via the existing avatar field for both create and edit."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Clean up manual-URL-related code paths in the Team Member form while preserving upload progress/disabled states, toast + inline error handling, and PhotoUrlPreview behavior.",
      "acceptanceCriteria": [
        "Any dead code paths tied to manual URL entry (e.g., `handleAvatarChange`, avatar URL validation errors meant for manual entry, and any now-unused imports such as `isValidUrl` if no longer needed) are removed.",
        "The preview component (frontend/src/components/team/PhotoUrlPreview.tsx) is still used to preview the currently stored/uploaded `avatar` URL and shows appropriate error state if the hosted image fails to load.",
        "The upload button remains disabled during upload; submit remains disabled during upload (no regressions to the existing protections).",
        "Successful upload still shows an English success toast; failures still show an English error toast and inline error text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TeamMemberFormDialog.tsx",
          "operation": "modify",
          "description": "Remove manual-URL logic: delete handleAvatarChange, remove `isValidUrl` import and any avatar URL validation on submit, and ensure avatar-related errors are only set by the upload flow; keep upload progress UI, disabling rules during upload, toast messages (English), inline error rendering, and PhotoUrlPreview preview wiring intact."
        }
      ]
    }
  ]
}